[ undefined,
  undefined,
  { name: 'Fresh start, anyone? Today's new moon in Libra and your seventh house of relationships helps you turn to a blank page in a storied (and heavily scripted) union. It IS possible to let bygones be bygones...if you can agree to leave a well-worn subject off the table for good. Begin to rebuild by focusing on common ground. New partnership possibilities may emerge as you find yourself dazzled by an attractive opposite. Whether for business, pleasure or a combo platter of the two, keep your mind wide open to new types.Craving a closer connection, Ram? Today, Mercury, the planet of communication, slips into your intimate eighth house until October 31. For the next three weeks, bonding with your nearest and dearest becomes top priority. You may decide to take a blossoming relationship to the next level (could it be time to say "I love you"?), or you and your partner might have a much-needed heart-to-heart. And be honest: Could you let go of some lukewarm associations to make more space for the ones that matter most?Are they worth your time...or wasting it? You may feel conflicted about people today, as a complicated Venus-Mars square casts you as the unwitting co-star of a "will-they-won't-they" rom-com. Don't make excuses for bad behavior or shortcomings. If people aren't ready to go "all in," keep them in the casual zone. On the other hand, you might be the one playing games with someone's heart. If so, check yourself and come clean. Dragging people through your uncertainty will only create bad blood. Coupled? This tense transit could leave you feeling annoyed with your S.O. Rather than making a mountain out of a molehill, take some space and time for yourself.Today, the moon is conjunct expansive Jupiter in Scorpio, helping you approach any knotty emotional or financial issues from a fresh POV. Perhaps a world-changing idea awaits your masterful touch. You have the rare ability to be both single-minded AND open-minded, so apply your powers of concentration to a visionary undertaking. Developing a financial model for a sustainable living nonprofit? Skillfully negotiating the final terms of a deal? Go for it, Aries. The eighth house rules joint ventures, so don't be surprised if an appropriate plus-one “magically” appears. Romantically, you could enjoy feeling like half of a "power couple"—or you could meet someone with serious dynamic-duo potential.Today, the Sun in Libra, your house of relationships, squares off with shadowy Pluto. If you're about to take a romantic partnership to the next level, you may realize there are matters that need to be addressed first. This could be anything from settling a tired old argument to something more serious, like resolving issues from your childhood that still color your interactions. It's worth investing the time and energy into healing, Aries. You'll feel lighter once you've shed that baggage.A long-distance connection percolates with possibilities on Saturday. Did you meet someone during your summer travels with whom you'd like to reconnect? Shooting off a quick text could lead to a surprising synergy. Or get plans underway to visit a friend (or love interest) who has relocated to a new metropolis. Closer to home, sparks could fly with a cutie from a different culture. Keep an open mind, Aries. Have you lost a bit of your edge during the quick transition from lazy summer to focused fall? You've got goals, but many of them are short-term—AND your steam may have fizzled once you really got started. You can get your fighting-spirit mojo back on Sunday as the moon shifts into Capricorn and your tenth house of career ambition and success. That heat you feel might be a fire getting lit in your belly. Think about what's most important to you, then take a big step in that direction!' },
  undefined,
  { name: 'Love is in the air! Today's new moon in Libra and your fifth house of amour accelerates your heartbeat. Solo Geminis may feel motivated to do some right-swiping. Prefer to mingle in real time? Find some Monday-night cultural activities, dress up and see who's there. If nothing else, this will be a warm-up for more flirty socializing. If you're in a relationship, do something to revive the playfulness and passion tonight. Don't shy away from the "what's next for us?" conversation. Even if house-hunting, getting engaged or making babies is NOT in your immediate future, it can be exciting to muse about it with bae. Clutter, clutter, everywhere! The time has come to streamline and systematize, Gemini—before you waste another second digging for "missing" papers and keys. With your ruling planet, clever Mercury, in your wellness and admin sector until October 31, you'll have plenty of momentum for this efficiency mission. Organize your calendar while you’re at it. Wouldn't it be nice to settle into a groove for a change? The idea of a structured routine might sound boring, but there's a lot to be said for the stability it provides. Schedule important things like exercise, grocery-shopping, house-cleaning and rest, so you can enjoy your social activities even more.Commit or quit? Today, you could experience a wave of uncertainty about a partnership as romanticizing Venus gets a harsh reality check from her dance partner, Mars. You may feel passionately engaged one moment only to be overcome with fears and "what if's" about the future the next. Avoid making any snap decisions while in this fluctuating emotional state. Although there are some details that need to be worked out, know that you're prone to overreacting during this transit. Let the storm blow over. By early next week, you'll have a much clearer perspective. Ready to break a sweat? The moon and expansive Jupiter do a buddy workout in your wellness zone, inspiring you to try a new routine. If you normally head straight to the elliptical, drop into a group class instead—better yet, tap into Jupiter's love of wide-open spaces and go for a bike ride or hike through the crisp autumn air. Experiment with new culinary creations (you could make it a group cooking sesh, since you'll be in a "more the merrier" mood), or swap your banana-based smoothie for a lean, green, antioxidant-rich juice. With the harvest of seasonal produce making its way into the farmer's markets, you'll easily find ways to "eat the rainbow," with zero feelings of deprivation.The Sun in your playful fifth house puts you in the mood for fun. But its tangled angle with possessive Pluto could demand that you spend one-on-one time with a close friend or romantic partner. Maybe you two need to clear up an unresolved issue, or your companion needs to confide in you. Don't get sucked into anyone's spiraling moods, but if you've neglected your closest peeps, give them some quality time. Would inviting them along on your adventures lighten their spirits? The more could be the merrier, even if they resist the idea at first.What was merely a romantic fantasy could turn into something far more tangible on Saturday. Yes, Gemini, like a real relationship—or the early sightings of one. Although the thought of being with Just. One. Person. (glug) can feel like a jail sentence to your free-spirited sign, you won't be bored with a partner whose interests are wide and varied. If there's no one currently on your radar, send out the search parties today. Attending an evening cultural event could lead to a fateful connection. Coupled Gems: Don't give in to the hibernation temptation. Dress up and go see a show! On Sunday, the moon moves into future-oriented Capricorn and your eighth house of wealth and shared resources. Since money doesn't grow on trees, you need to learn more about investing and figure out what's the best course of action for you, whether you've been saving for years or are just getting started. Talk to some savvy friends about what THEY do, and begin your own research by reading a personal finance blog.' },
  { name: 'Dream globally, act locally. Today's new moon in your third house of hometown happenings heats things up in your zip code. You might think you've seen it all, but guess again, Leo. You never know what's percolating on the underground scene. Still not turning up any good leads? Get the action started yourself—if not for the entire population, then at least for YOUR people. Connect to a local venue about co-hosting an ongoing event, like open-mic night or karaoke—or maybe monthly tarot readings. La luna also lights the way to kindred spirits. If you've been in a social slump, get out and explore a new scene or three before the week is through.Oh, the feels! As Mercury dives into Scorpio your sentimental fourth house until October 31, you'll take a plunge into the emotion ocean. Prioritize time with your inner circle during this sensitive cycle. You'll find their company both comforting and uplifting over the next three weeks. Make a nest with some throw pillows and a cozy blanket. You'll crave more quiet time in your lair as Mercury gives you a break from the social whirlwind and crowded venues. Chateau Leo may become the hottest gathering spot in town. Bring on the dinner parties and laid-back crafting and movie nights!Playing caretaker again, Leo? Unless you're dealing with actual children, don't get swept into that role. Today, as Venus retrograde locks into a tense square with Mars in your relationship house, you might have to inform some people that you are no longer available as their on-call support. In your generous zeal, you may have trained them to treat you like their personal secretary, hired hand or chauffeur. Don't unload a laundry list of resentments or pull out the scorecard; but do make it clear that you're only available during specific times (and for certain activities). And if you could use THEIR support with something, don't drop hints—ask them directly!Cozy doesn't have to be confining. Today, the moon and expansive Jupiter meet in Scorpio, your domestic fourth house, inspiring you to throw open the doors of Chateau Leo. Host an impromptu dinner party or just let friends know they're welcome to drop by for a casual visit while you're crafting and watching movies tonight. Jupiter rules travel, so you might feel the call to hit the road and go visit loved ones (a great plan for the weekend) or invite an old pal to come stay with you for a few fun nights. The coast is clear for heartfelt chats and honest revelations. Maybe it's time to make up with your sister or estranged friend, Leo.Watch your words, Leo. Today, the energizing Sun is in Libra and your third house of communication, where it's squaring off with nefarious Pluto. You'll be tempted to pass along some juicy gossip, especially if you overhear something too scandalous or interesting to keep to yourself. But talking about people behind their backs leads to bad karma at best and a tarnished reputation at worst. Instead of spilling your guts, ask yourself why you feel the need to spill someone's secrets. There are other ways to bond that don't bring people down.Just friends...or is something else bubbling below the surface? Saturday's Sun-moon mashup blurs those boundaries a bit. An unspoken attraction could finally be addressed, if for no other reason than to clear the air. Then again, this could lead to a scintillating evening and maybe ongoing benefits. Already attached? Revive the early days with an evening on the town. Opt for an active or thought-provoking date that lends itself to fascinating postgame discussions over dinner and a bottle of vino. On Sunday, as luna marches into Capricorn and your sixth house of well-being, you may be inspired to clean up your diet or get a little more hardcore with your fitness regimen. "Healthy" doesn't have to be boring or full of deprivation, Leo! If you've been living on calzones and haven't seen your yoga mat in months, don't beat yourself up. This is a perfect starting point! The hardest step is always the first. Keep the emphasis on having fun: That's what'll keep you motivated!' },
  { name: 'Today's new moon in Libra kickstarts an economic-stimulus plan. Is it time to circulate your resume or pitch new clients? Polish up your presentation materials and online profiles: A close friend may have a hot lead! Securely ensconced in a 9-5? Your job description could change in the days ahead. Make sure your skills are up to snuff and be willing to learn something new as the company grows. Freelancing Virgos should network purposefully. You could make a killer contact at an industry soiree. Do you need to be more sensible about the money you already have in the bank? Retool your Q4 budget, eliminating unnecessary recurring charges. Then make sure you're transferring enough funds into your savings account for both a safety net AND something indulgent, like an early 2019 vacay.Ready, set, collaborate! Garrulous Mercury (your ruler) sails into your third house of communication and cooperation until October 31, turning you into networking machine. Whether you're guiding your squad through a cultural-activities tour or working your superconnector magic, you'll have endless charisma. If you're struggling to bring a goal to fruition, embrace the power of partnership. Turning a solo project into a joint venture could bring major gains. While you're at it, get your transportation game up to snuff. Update your ride (or organize a ride share) and invest in a digital device to make your commutes more enjoyable.Loosen up that iron grip, Virgo—even if things aren't going the way you planned. Your desire for control will only slow you down today, as empathetic Venus gets into a strained formation with aggressive Mars. Obviously you don't want to turn into a micromanaging tyrant, but you won’t settle for things that aren’t up to snuff. Before you bark orders, listen to other people's ideas. Someone may actually have a more effective way of doing things—and it could make YOUR life easier. If your plan is still the best one, then stick to it. But partners and teammates will be more agreeable if they feel like their thoughts have been heard.Can't. Stop. Talking! Today, the moon and outspoken Jupiter double down in Scorpio activating your third house of communication and cerebral pursuits. Your mind is on fire with brilliant ideas, and you're on a mission to share them with as many people as you can. Fueling this desire for a global platform is expansive Jupiter, so whether it's a blog, a YouTube channel or a workshop of your own, you KNOW that your witty gems are too good to keep to yourself. You may also be equally hungry to soak up new ideas, so download a new book or see what evening lectures and classes are coming up. Tonight, your inner culture vulture is up for anything, so explore the treasures in your own neighborhood. Kindred spirits await!Your regimented sign functions best when you stick to a plan, a routine and a budget. But with the Sun in your practical second house forming a tricky square to compulsive Pluto, you might rebel against your own overly managed life. A friend could ask for a last-minute favor that eats up your time, or you may be tempted to shop away a stressful day of work. No instant gratification is worth derailing your progress, Virgo, but this mini-crisis could be a call for balance. Make room for moderation so you can enjoy working AND playing hard.How's that nest egg of yours, Virgo? As a security-minded earth sign, you sleep easier at night when there's a little something tucked away. No matter where you are on the savings-plan continuum, set aside some cash, yes, even if it's just a few symbolic dollars. Open up a special account for this purpose and have funds auto-transferred weekly. Already an investment pro? A promising opportunity involving women could emerge on Saturday. Explore! On Sunday, when a strategic Capricorn moon struts into your glamorous, creative fifth house, stop fretting about deadlines and bottom lines and listen to your muse. Check in with inner artiste and take stock of that unfinished painting, screenplay or hip-hop opera. Or, hmmm, maybe the real project is YOU, Virgo! What better or more deserving object for your inspired touch than yourself? Redo your decor, or update your closet for the season. You know when you look good, you feel good—AND are more productive.' },
  { name: 'Happy cosmic New Year! Today's new moon in Libra hits the refresh button on your internal browser, clearing away that heavily cached personal history…or at least helping you focus on the brighter days ahead. You only get one new moon in your sign per year, so take advantage of its manifestation mojo! Write out a wish list for the next six months. How would you like to grow? What areas of life could use some magic? If you want to accelerate this process, don't just sit there; take decisive action around your dreams. You have the celestial green light to invest in your own self-development, be it a life-changing class, sessions with a supercoach or a spiritual pilgrimage that nourishes your soul.Strengthen your financial foundation, Libra. With messenger Mercury settling into your second house of security for the next three weeks, it's an ideal time to get your cash flow in order. Saving up for a rainy day doesn't hold much appeal for a sign that doesn't even BELIEVE in rainy days. Approach the number-crunching from a more positive perspective. What sunny moments do you want to map out for the future? Enlist the help of a savvy friend in the industry or sit down with an adviser. Even if you've got a solid budget in place, think outside the box for ways to make bank.Today, a perplexing square between your ruler, love planet Venus (retrograde), and scintillating Mars could leave you befuddled about your love life. On the one hand, you'd like nothing more than to snuggle up to someone reliable; but you're also craving variety and fresh experiences. If you're attached, don't give in to the temptation to stray. A wandering eye could lead to serious drama, and you'll regret it a few days from now when this energy passes. Of course, if you're single, follow your gut—and something a little further south! You'll be fine, so long as you don't confuse a one-night stand for The One.Feeling lucky? You might as well splurge on a lottery ticket since the moon is aligned with lucky-charm Jupiter in your second house of moolah. A small gamble could bring a windfall—or you could snag a new client who’s willing to pay you what you’re worth (that alone is like winning the lottery!). In general, be a little more open and willing to go for something if it feels right. That person you’re making small talk with at the industry mixer might wind up being your next big account.Watch out for a "my way or the highway" attitude today, Libra. The Sun in your sign is squaring off with controlling Pluto, causing you to act stubborn and rebellious with your close friends and family members. Before you engage in a battle, make sure the fight is actually worth it. Do you need to clear up unresolved resentment or anger? As much as you dislike confrontation, you need to deal with it diplomatically and directly—and be willing to own your part in any conflicts.Bend, but don't break, Libra. On Saturday, a compromise can be reached that doesn't require you to make too many sacrifices. How much are you willing to give, and where is your bottom line? Be clear about this before you enter discussions. You have the gift of gab today, and you won't get much (if any) resistance when you turn on the charm. Don't veer to the other extreme and take advantage of anyone's kindness, though. Aim to be fair and equitable: It's the Libra way. If you're not in social spirits on Sunday, don't push yourself to make it to brunch. The moon downshifts into quiet Capricorn and your sensitive fourth house. Emotions could run high, causing you to feel a bit touchy and vulnerable. Spend the day at home; time in your happy place will take the edge off things. If you do have to deal with others, allow yourself a time frame that can be flexible and get you back to base at a decent hour. Sunday night is perfect for staying in or hanging with just one person, someone you don't feel the need to be "on" around.' },
  { name: 'The softer side of Scorpio is peeking through! Today's new moon in your soulful, compassionate twelfth house tugs at the old heartstrings. Drop your guard and let the feelings flow. The intuitive hits you get could make you feel like a walking psychic hotline. Trust that inner knowing and where it’s leading you. Alas, you may realize that it's time to leave a situation that is no longer serving you. Gently back away—you CAN do this gracefully so that no one is traumatized. With this new moon piquing your imagination, a stimulating artistic endeavor could be the perfect thing to engage in this fall/winter. Feeling blocked? Dive into Julia Cameron's "The Artist's Way," a 12-week course for recovering your inner creative.While you might prefer to fly under the radar much of the time, when expressive Mercury moves into your sign until October 31, you may be called into the public eye. Forget being modest or settling for a humblebrag; it's time to self-promote! Worried that people will judge you as being arrogant? Focus on how your skills will benefit others. If you've felt out of sync with a friend circle, don't force the togetherness out of misplaced loyalty. Seek people who share your current interests and make room for those who will help you soar. This is also a perfect time to dive into a solo project and enjoy the pleasure of your own independent company.No pouting, please, Scorpio—and stop yourself from storming out of the room. Today, a tense battle between Mars in your sensitive fourth house and retrograde Venus in Scorpio could throw your emotional equilibrium out of whack. You want attention...and you want it from one person in particular. But they might not be able to give you that—at least not on your timeline. Don't declare them "dead to me" simply because they failed to return your text within an hour. See the "space" as a plum opportunity to expand your social horizons…with someone else. Truth is, you'll be a happier Scorpio when your love tanks are filled at more than just one station. Been waiting for a sign to make a gutsy move? How’s this: The moon aligns with lucky Jupiter in your sign today, helping you shatter barriers in any arena. You've never been one to pay deference to group-think, but how often do you actually share your own strong opinions and brilliant ideas, Scorpio? No more holding back! Need a pep talk? Ask a couple close people what they think your best traits are and where you could stand a little improvement. Stay open to their feedback; a few tweaks could make a huge difference.You don't take kindly to others invading your territory or taking credit for your ideas, Scorpio. Today, with the Sun in your house of hidden agendas forming a tough angle to your co-ruler Pluto, you'll be ready to defend yourself against any perceived threats. A conflict with a colleague, friend or sibling could arise, and the only way to handle it is to get to the bottom of it. You might realize your perception is wrong, but if it isn't, dive in and address the issue.You're a master at spotting untapped potential, Scorpio, and this Saturday, it could be staring you in the face. Are you willing to take an ingenue under your wing? Weigh the costs and potential benefits. Beyond simply paying it forward and helping to advance a sweet soul toward their life purpose, what's in it for you? You could groom a trusty sidekick or creative collaborator, which would make your life richer indeed. On Sunday, as the moon dips into Capricorn and your super-connected communication center, you might feel like you don't have enough privacy in your life. While you enjoy socializing, you like to do it on your terms, sometimes preferring the company of just one friend, a pet or Netflix—which is fine. Just make sure you're not compensating with an overreliance on your social media friends. Interacting virtually doesn't cut it after a certain point. Get out and take a risk by meeting new people. Under these moonbeams, you could be pleasantly surprised by who shows up.' },
  { name: 'You've never met a stranger, Sagittarius—but who are your true people? Today's new moon lands in your eleventh house of community, helping you radar in on a squad of kindred spirits. Already found them? This is your nudge to become the nucleus of a supergroup, bringing together these wunderkinds from the various areas of your life. Once you do, expect a buzzy fall/winter season as you meet for weekly potlucks and even plan a group vacation. Look for online forums and Facebook groups that revolve around your more “fringier” interests. Your inner geek will also be piqued. Got an idea for an e-venture, blog, mobile app or other online mission? Call up the developers or learn the necessary coding. This could turn into something enjoyable—and profitable—over the coming six months.Energy vampires, begone! Social Mercury cruises through your healing sector until October 31, helping you snip toxic ties. In addition to warding off the draining soul-suckers, pay attention to your inner dialogue. Start replacing any self-critical thoughts with tons of self-love and affirmations. If you keep hitting the same frustrating wall in a relationship, take a breather for the next few weeks—or if you know this impasse can't be healed, break it off for good. But don't give up before consulting the pros. Therapists, mentors, coaches and spiritual leaders can support you with clearing away the psychic clutter and replacing it with authentic self-confidence.Sending out mixed signals, Sagittarius? Uh-oh. Under today's volatile mashup of sensitive Venus retrograde and aggressive Mars in your communication zone, don't be coy or vague or even remotely mysterious—well, not unless you want your words to be seriously misinterpreted. If you're not ready to touch a certain subject, avoid people who seem to be angling for a fight. The tension should blow over soon, but engaging today could escalate a minor grievance into an all-out war.Take time during the day to reflect on how you’re really feeling. When people ask, you may auto-respond with "great!” But how true is that? Today, as the emo moon buddies up with your ruler, philosophical Jupiter, in your introspective zone, you’ll have a clear channel to what’s going on deep inside your soul. You don’t have to wear your heart on your sleeve or burst into tears, but if you’re feeling overworked or down, it’s okay to let people know. They might actually find it easier to connect with you when you drop your guard.With the life-giving Sun in Libra and your free-spirited eleventh house, you'll be full of big ideas today; but a tense square to shadowy Pluto in your stable second house delivers a reality check. It's not that you shouldn't have grand dreams, Sagittarius—those travels, business ideas and visionary projects are all achievable. It's just that nothing will happen without a proper plan. Instead of just diving in, take the time to think it through from every possible angle. And don't forget to map out a budget!You could use a little breathing room from anyone or anything that's too demanding on Saturday. Fortunately, a flowing moon-Sun formation paves the way for playful diversions. Spend the day reading, shopping or working on crafts. Make evening plans with an inspiring, eclectic and fun-loving crew. From karaoke to a live show to dancing at a dive bar, the time has come for you to let down your hair. On Sunday, when the moon marches into grounded Capricorn and your second house of money and security, it's the perfect time to check your bank and credit card statements and pay some bills in a timely manner. Sometimes even your visionary sign needs to climb down from your mountaintop and deal with the mundane, pragmatic things that keep the wheels of everyday life greased. If your expenses are outpacing your income, you might want to get a little more serious about creating—and sticking to—an actual budget.' },
  { name: 'Ready to rise up a few professional rungs—or maybe take control of the whole ladder-making industry? Today's new moon in Libra activates your ambition, helping you think even bigger! Pause from the grind to map out some six-month career goals. Your mind may be on ownership, which is where the real money comes in. (Hello, CEO.) If you're still a rookie in your field, train your sights on growth opportunities. Volunteering alongside an industry VIP might be the fastest way to get a combat boot in the door, Capricorn. And there's no doubt you'll dazzle when you do, which could set you up for accelerated progress.There's strength in numbers, Capricorn! Today, communicator Mercury moves into your eleventh house of teamwork and technology until October 31. Connect to kindred spirits through group activities and social media—and organize your own online community if you feel inspired to bring people together. This three-week cycle is all about collaboration, so keep your radar attuned for team-based projects that could utilize your expertise and organizing powers. Join forces with like-minded folks—some seriously innovative ideas could come out of your brain trust.Moody much, Cap? Today, your stability-seeking side could be at war with your independent streak as Venus retrograde and Mars lock into a tangled angle. One minute you're pushing people away so you can get some much-needed "me time"; the next, you're pouting because no one invited you to hang out. You can't have it both ways, Capricorn, so stop yourself from sending any messages when you're feeling unclear. And as a rule, don't make any radical decisions while you're in this conflicted emotional state. Just because you're feeling tempestuous today doesn't mean you won't need solid supporters at your side tomorrow.Your leadership skills are a point of pride for your visionary sign, but admit it, Sea Goat: Sometimes it can get a little lonely up on your perch. Today's socially stimulating sync-up of the moon and effusive Jupiter in your communal eleventh house can act like an icebreaker with a new clique or group. Just show up with your can-do energy, and people will flock to you. Resist passing judgment till you get to know what they’re all about. This could be the very squad you’ve been looking for!If you want to compliment a Capricorn, make a positive remark about a professional achievement—and if you want to enrage a Capricorn, offer unsolicited advice in that department. Today, the Sun is in Libra, your tenth house of ambition, where it's forming a tangled angle to controlling Pluto. If anyone tries to patronize you with condescending career suggestions or attempts to micromanage you, you'll take umbrage. Look past your ego and listen to what's being said—you might miss out on some legitimate advice if you don't keep an open mind.An imaginative, can-do angle between the Sun and moon helps you pull off a brilliant plan this Saturday, one that could put your name on the map. Think big...now bigger still. The sky isn't even the limit for you. You're capable of more than you've given yourself credit for. Err on the side of being "too much," and you'll hit that ambitious mark. On Sunday, the moon grooves into your sign for the next two and a half days. All work and duty all the time? No way, Capricorn! This is all the permission you need to bow out of any "requisite" mind-numbing events and spend your time engaged in activities that make you happy and keep you stimulated. As for anyone who tries to guilt-trip you into going anyway, let them know you appreciate their desire to spend time with you and that you're happy to see them—but today, you're flying solo!' } ]
