'Dive into those mermaidy depths, Pisces. October always starts out as an intense and introspective time for you as the Sun makes its annual rounds through Libra and your private eighth house until October 23. You’re not exactly eager to be in the limelight now, especially with energy planet Mars in your sleepy, escapist twelfth house until November 15. Swim under the radar as much as you can. This is an excellent time for behind-the-scenes work, intensive research and focused tasks you can do without distraction.The eighth house rules merging, and this solar cycle can strengthen your bonds with the innermost members of Team Pisces. You don’t have to isolate yourself or struggle alone—in fact, please DON’T do that. If you’re grappling with something complex and confounding, reach out to trusted people for support, whether friends or a professional, such as a therapist or energy worker. Real estate, long-term finances and other assets also fall under the eighth-house domain, so use this month to assess your plans and make sure you’re properly set up for the future.From investments and shared finances to engagements and pregnancies, the Sun in this perma-linking zone has you evaluating all your closest alliances—and how far you want to go together. Libra season could spark a strong mind-body-spirit attraction to someone, so keep your antennae up for a sexy soulmate or, if you’re in a relationship, for ways you can deepen your intimacy. At the October 8 Libra new moon, you could receive a proposal, either romantic or business, or you might zoom in on one particular relationship that deserves your undivided attention.And you’ll have good reason to do that because from October 5 to November 16, Venus, the planet that rules love, interpersonal harmony and social graces, will be retrograde, which could disrupt the flow of your most important ties. Have you swept something under the rug or bitten your tongue when something hurt or offended you? Venus retrograde can help you to deal and reveal in order to heal.This six-week cycle, which happens every 18 months, can bring back an old love or cause partnerships to fracture, even split. But more than anything, it’s a relationship review and repair time. With Venus backing through Scorpio and your ninth house of personal growth, truth-telling and the big picture until October 31, you’ll be in the best possible position to evaluate what’s working and what’s amiss in your closest connections. Speak truth to power, Pisces, by getting authentic with the important people in your life. Just don’t abandon your manners or tact. While gracious Venus is retrograde in the bluntest part of your chart, you could accidentally burn a bridge instead of building one if you get too in someone’s face. Mind your cultural I.Q. when posting online, too, as Venus’ backspin in this global zone could cause an insensitive moment to go off the rails. On October 31, Venus will back into Libra and your erotic, emotionally intense eighth house for the duration of the retrograde. With Venus retrograde here until November 16, you could be tempted by a clandestine affair or a “sex with an ex” scenario. Buried emotions could bubble up like a dormant volcano, and you may find yourself unexpectedly working through some old wounds around trust and betrayal. Better now than never, Pisces.Some lightness returns on October 23, when the Sun enters Scorpio and your expansive ninth house for a month, shifting your setting from “micro” to “macro.” With this wide-angle view, you might finally be able to address some of those intense emotional issues and upsets that have been festering with Venus retrograde here. Communication planet Mercury is also in Scorpio from October 9 to 31, helping you find the words to explain where you’re coming from. Stick to “I” statements and avoid “you” ones (e.g., “You never do X” or “You really hurt me when…”), which only put others on the defensive.The next day lets you get things out into the open—at last! On October 24, the year’s only Taurus full moon will ignite your third house of communication and community. An idea that’s been percolating since the corresponding Taurus new moon on May 15 could reach an exciting turning point. Have you been waiting for news or a green light on a project? Fasten your seatbelt: It could come at you without notice since the full moon lands in close proximity to Uranus, the planet of sudden events. You could get involved in a neighborhood activist project or a social justice initiative where you can voice your beliefs freely.But expect the unexpected with the Sun and Uranus also forming their annual opposition, which could drive up egos and turn simple conversations into raging arguments with little warning. Oops! Tread lightly with the incendiary posts and talks, even as you voice your authentic truth. Try to be as gracious as possible with people whose opinions are diametrically opposed to yours—or to swiftly change the subject and “agree to disagree.”With unconventional and tech-savvy Uranus in the picture, you may get inspired to share your message through social media, video or a podcast. Think outside the box when it comes to your social circle. You could have surprising chemistry with someone who you wouldn’t normally expect to befriend. Vive la difference! If you own a business, this is a great day to spruce up your marketing materials and online presence or to send out an e-blast with an irresistible offer.Happy, healthy Halloween? With the moon in Leo and your sixth house of work and wellness, you might not be in the mood for candy binges and risque costumes. While you don’t want to be a curmudgeon, you may be happier in a “service” role—passing out treats (agave-sweetened, maybe?) or turning festivities into a fundraiser. But careful how much you sign up for because the moon will form a biting square (90-degree angle of conflict) to the Sun in your freedom-seeking ninth house. You don’t want to be stuck holding the limbo stick while everyone else is partying their heads off. At the same time, you’ll be glad if you keep things a LITTLE tame. With social Venus opposing unpredictable Uranus, there could be stupid arguments and heated tempers blowing up under those masks and getups. Keeping things to a dull roar could save you from getting dragged into drama.Put yourself out there or retreat into your sanctuary? Some days, you feel like risking it all and opening your heart as wide as possible. But as soon as you do, you might want to withdraw to your cocoon to nurse a “vulnerability hangover,” as Brene Brown calls it.Blame it on the love planets, Venus and Mars, which are having a really hard time getting on the same page this month. Intensifier Mars is making its second trip this year through Aquarius and your twelfth house of healing, closure and hidden agendas from September 10 to November 15. You may be recovering from a painful situation or simply not able to locate your mojo (it’s not missing, but it MIGHT be in power-save mode). Your emotions could be raw and fragile—and on top of that, Mars in this restful zone could interrupt your sleep patterns, making you moody and withdrawn. Pisces emotions can already swing wildly—you don’t need the extra “help” in that department. Make sure you have support if you’re processing a heartbreak or loss of any kind. On the upside, sexy Mars in this fantasy-fueled zone could ignite a windswept romance with all the tantalizing trimmings and erotic escapes. Warning: You’re susceptible to getting so caught up in an attraction that you fail to conduct necessary due diligence (like, is this person even available?). For couples, this could be a prickly time—if not also an opportunity to turn up the romance full-blast. Get away from the familiar, even if it’s just for a day trip, and it will be easier to open your hearts to each other again. But with Venus gone awry in your travel zone, save any romantic vacations for the holidays or even early next year.Meantime, romantic Venus is ready to leap without a parachute as she barrels through Scorpio and your ninth house of expansion, risk-taking and honesty. But from October 5 to November 16, she will be retrograde, backing through Scorpio until October 31. Your attempts to “speak your truth” may backfire, especially on October 10, when Venus and Mars lock into a tense square (90-degree angle of conflict). Being outspoken could backfire, especially if your thoughts aren’t totally clear. What starts as an attempt to clear the air could devolve into finger-pointing, shaming and blaming. Save those conversations for another day!    Venus-Uranus opposition This impulsive and rebellious clash may tempt you to do something “just because.” And even though it might feel amazing in the moment, when the mist evaporates and you’re seeing things clearly, you could be left with a heap of regret. If you need to be talked down off the seductive ledge, call a friend!Are you playing for keeps, Pisces? This month, with the savvy Libra Sun sailing through your eighth house of investments and long-term wealth, you have an opportunity to check your progress in this department and correct course if necessary. And when the year’s only Libra new moon lands alongside el Sol on October 8, you can make an investment or a savvy financial move that yield returns over the coming six months.It’s not easy to hand your power (in form of your funds) to someone else, and if you’re not “good” with finances, then having a trusted investor or planner is key. And yet it’s your money and your future, Fish, and you do need to keep on top of this. This eighth-house solar power surge, which lasts until October 23, can help you face any fears or anxiety you have around finances and deal with them in an effective way. You’re building for your future, and it’s important that the money you work so hard for is working just as hard for you! If you’re intimidated, talk to a friend who’s good with money and learn the fundamentals. You might be surprised how easily you “get” it. And if you’re already good in this area, take a bold next step, perhaps considering a real estate deal or funding a “can’t fail” startup.An opportunity to partner up with someone whose skills complement your own could arrive on or near the Taurus full moon on the 24th, as la luna shines the spotlight on your kindred spirit sector. But take it easy! Energetic Mars in Aquarius is still operating on low-power mode in your sleepy twelfth house until mid-November, encouraging you to catch up on rest and make sure you’re clear on everyone’s true motives before rushing in.   October 2: Mercury-Pluto square You’d love to be an open book at work, sharing your true opinions and giving honest feedback. Yet under this dicey face-off, people may be judging you or acting on a secret agenda. Make like a good poker player: Hold your cards close to your chest, and when necessary, bluff!: 0 : ''Spread your wings, Water Bearer! The Sun is soaring through Libra and your expansive ninth house until October 23, giving you a wide-angle view on life and emboldening you to take risks—creatively, emotionally and in every way. To your future-forward sign who’s happiest when you have something big to look forward to, Libra season might be one of your favorite times of year. With your mind so open to new possibilities, you’ll easily stumble upon spontaneous moments that can lead to new friendships and adventures. Follow your curiosity, Aquarius, and see where it takes you.The ninth house rules travel, learning and entrepreneurship. The October 8 Libra new moon is the perfect time to get any such plans underway. You could head to far-flung shores for a bucket-list trip (or at least start saving up for one), enroll in a mind-expanding workshop or class, or publish your work. Maybe you’ll launch your own indie business venture, like the creative Aquarius designer behind Freda Jewels, who curated vintage pieces from around the world into custom protective amulets. Tune in to your passion and find a way to share it, Aquarius—adding your own unique stamp, of course. Seeds planted at the Libra new moon will get extra fertilizer because they’ll culminate with a rare TWO Libra full moons in March and April of 2019.You’re even more motivated to “do you” this October because energizer Mars is blazing through YOUR sign from September 10 until November 15, giving you the courage and charisma to pursue your passions and put yourself out there. Mars typically only visits your sign every two years, but this year it’s been in Aquarius twice. The first round, which was from May 16 to August 12, was interrupted by a two-month retrograde that began on June 26. With Mars granting you a “do-over,” ideas that stalled over the summer could hit the accelerator now.There’s another reason to distract yourself with hobbies, launches and adventures. From October 5 to November 16, Venus will be retrograde, disrupting its domain of relationships, harmony and beauty. Everything from love to aesthetics to friendship can go awry during this six-week cycle, which happens every 18 months. With the Galactic Governess of Glamour and Goodwill hanging her “Do Not Disturb” sign, people’s normal levels of compassion and kindness could go MIA.During Venus retrograde, exes can creep out of the woodwork, and old issues resurface. Relationships of all stripes could hit speed bumps. Whether those lead to a turning point or a breaking point depends on how you handle the curveballs of this retrograde. With Venus backing through introspective Scorpio from October 5 to 31, we advise examining your own unconscious motives, trigger and blind spots before pinning blame on anyone else. We’re not suggesting you lower your standards or stop holding people accountable. But remember that relationships are mirrors that offer the opportunity to see deeper dimensions of ourselves as we move through the vulnerable and sometimes scary process of trust and intimacy.For you, Venus’ retrograde through Scorpio will take place in your tenth house of career and long-term goals. This could stir up ugly office politics and discord among coworkers. Considering an office romance? Proceed with the utmost caution while Venus is retrograde here. For couples, this reversal will raise the issue of whether you want the same thing for the long haul. Pause to assess: If, for example, one of you feels like life would be incomplete without children but the other is fairly certain they never want kids, you won’t be able to sweep that aside in the name of love.The tenth house rules fathers and men, and Venus governs the feminine. As October begins in the wake of the Kavanaugh-Blasey Ford Senate Judiciary hearings, some Aquarians may come down with a burning case of “patriarchy flu” (a chronic condition for many justice-loving Water Bearers, TBH). If you find yourself triggered during this Venus retrograde, seek outlets for emotional support because this lightning-rod issue can resurrect a host of buried trauma and lead to profound confusion and anger. On October 31, Venus will back into her home sign of Libra for the duration of the retrograde (until November 16), reversing through your ninth house of travel and truth-telling. Research a romantic getaway but wait to press “book now.” Heads-up: On November 16, right as Venus turns direct, Mercury will go retrograde until early December, a time that’s notoriously tricky for travel. Distract yourself with fare alerts and a “dream vacation” Pinterest board in the meantime. On October 23, the Sun moves into Scorpio and your tenth house of career and ambition, fueling your #bossgoals even more. Stay out of any pettiness and pour your energy into a bigger project. As the confident Sun connects with Venus in Scorpio (and communicative Mercury, which is here from October 9 to 31), you may finally find the words to address a relationship rift or to discuss clear boundaries and agreements with an important person.But take a break from being “all business” on October 24 and make time for home, hearth and heartfelt bonds. The annual Taurus full moon lands in your domestic and sentimental fourth house. The spotlight is on personal matters, so take a deeper look at your emotions. If you’re thinking of moving, buying or selling property or expanding your brood, this full moon could set things in motion.Have you been too busy for self-care? Treat yourself to some resting and nesting to refill your tanks. Warning: With the Sun and volatile Uranus making their annual opposition across your home and career axis that day, you could tip into emotional overload. Your stormy reactions could be intense, and you may not be able to keep strong feelings inside, especially if someone oversteps a boundary. Try not to completely eviscerate them, Aquarius, even as you make your limits excruciatingly clear. And if you find yourself on the verge of yelling at everyone in your office for no good reason, that’s your cue to retire to your bedroom or favorite spa, posthaste. Mood management will be crucial today. Once THAT blows over, fetch the matching Halloween costumes! If you’re celebrating on October 31, the moon will be in Leo and your partnership house, a night for dynamic duos of all stripes. Whether you head out with your favorite plus-one or meet someone while you’re adorned as your favorite TV characters, two is the magic number this Fright Night. With the moon squaring the Scorpio Sun, however, duty may call, so try to get ahead of the work curve so that a midweek deadline or other responsibilities don’t cut into your quality time a deux.Retrograde Venus will also oppose Uranus, bringing another round of unpredictable mood swings and potential outbursts with a friend or love interest. Before you pass out the first handful of snack-sized candy bars, you might need to have a clarifying convo about needs, expectations and even where a relationship is going. Maybe not exactly what you had planned for the night, but with the love planet and the celestial disrupter at odds, a few curveballs could come hurtling your way.You’re feeling fiery and frisky…but what to do with all that energy? The love planets, Venus and Mars, have opposing agendas this month, and you may find yourself unsure of which move to make. When in doubt, wait it out. In the meantime, though, would it hurt to have a little consensual, no-strings fun? Hmmm…On the “just do it!” side of the voter booth is red-hot and randy Mars the lusty planet has taken up residence in YOUR sign from September 10 to November 15, boosting your libido to max levels. And don’t think people can’t sense it! If you want to flirt up a storm and nobody gets hurt, who cares? Just know that your perception of a “hot stove” might be askew, and you could be quick to touch that metaphorical Viking range before realizing you’re getting singed. And while Mars boosts your mojo, it also increases stress. You could feel the heat in other (less enjoyable) areas of your life—at work or home, for example, where everyone seems to be demanding something from you 24/7. Make sure you have a lot of outlets for your frustration besides sex and arguing! (Yeah, one could lead to the other…but still.)But pressing you to pause for the cause is Venus, the ruler of love and romance, who will turn retrograde (backward) from October 5 to November 16. Until October 31, Venus is reversing through Scorpio, disrupting your tenth house of future plans and structure. Aligning around a common agenda won’t be easy—in fact, it could be the source of a few heated arguments. Can you work this out? You’ll probably need to have a few difficult but necessary conversations to get your answer. Single Aquarians may feel pulled in two directions: Part of you wants to fly free (that would be Mars talking) and another is pining to have someone to bring home for the holidays or cozy up with as the temperatures fall. Since the tenth house rules career, you might be tempted to take an office flirtation to the next level. Check company policy—and your own common sense-ometer—before you go there!It’s hard to make a move when you’re running this hot and cold, and that pot could reach a boiling point on October 10, when Venus and Mars lock into a tense square (90-degree angle). Try not to make any binding decisions (or exits) that day. Rather, take a step back and try to weigh the pros and cons of every option. Run this by a wise adviser or two. If you’re under a lot of stress, you’re more likely to act impulsively, which could cause repercussions you really don’t want.  Taurus full moon Dare to bare—your feelings, that is! The year’s only Taurus full moon lights up your sentimental and sensitive fourth house and could trigger an avalanche of emotional outpourings. And how great does that feel? In the coming weeks, you may seriously consider a change of residence or relationship status. Time to make it official?Look who’s on a roll! You’ll be full of motivation thanks to impassioned Mars blasting through your sign and giving you more energy and charisma than you’ll know what to do with. Not every interaction needs to have a “purpose,” either. Sometimes just getting to know people and exploring possibilities can lay the groundwork for things that will develop later. Try to enjoy the process and not get hung up on results.Messenger Mercury pours even more fuel in your tanks when it joins superconnector Venus in Scorpio and your ambitious tenth house on October 9. This can give a high-pro glow to your career persona AND add a coat of glossy polish to all your business dealings. Lead with your natural curiosity about other people and be supportive of all ideas—at least until you’re fully on-board. Then you can bring your wise critical assessments to bear.You’ll be open to new ideas and opportunities with the Libra Sun sailing through your global, risk-taking ninth house until October 23. Suddenly the prospect of working from a remote location might sound irresistible. Throw your hat in the ring for any jobs that appeal to your sense of adventure. You don’t have to accept the first thing you’re offered, but your nomadic side might enjoy a gig with a little less structure and a lot more flexibility now. This is also a good month to take a workshop or acquire advanced training. Anything that expands your mind and gives you a competitive edge is favored, especially around the Libra new moon on October 8, which will plant seeds in these areas for the coming six months. On October 23, the Sun moves on to Scorpio and your ambitious tenth house for a month, reinvigorating work goals that you’d love to tick off the list before the year draws to a close. But pace yourself, Aquarius. With Venus retrograde here until the middle of November, unrealistic expectations could water down your enthusiasm and cause you to waver. All things in good time!   October 2: Mercury-Pluto square Your blurt could hurt—either someone’s feelings or your reputation—under today’s foot-in-mouth mashup. Warning: Careless words you utter can and will be used against you, since vengeful Pluto is famous for saving receipts. Don’t give people ammunition. For example, gossiping about a coworker or mutual friend could get back to that person, leaving you with a big mess to mop up. Be extra vigilant with what you email or text.: Gather with your tribe, Archer. The Sun is in Libra and your eleventh house of group activity until October 23, the perfect three weeks to network, entertain and collaborate. Although you’re an independent sign by nature, you need people—and now is the time to put a few key players in place to support your mission.Next month, your ruling planet, expansive Jupiter, will move into your sign for the first time since 2006. From November 8, 2018, until December 2, 2019, the red-spotted planet will put your personal goals on the fast track. Trying to do it all yourself will be a recipe for disaster, so start taking applications for Team Sagittarius now. The October 8 Libra new moon could bring an exciting alliance or a chance to join forces for a world-bettering cause.  But screen those applicants with the utmost care. From October 5 to November 16, harmonizer Venus will be retrograde, a challenging cycle that happens every 18 months, disrupting dynamics and fracturing relationships. When Venus, the cosmic Grande Dame of Lovingkindness, sets up her autoresponder, our pings and pleas for compassion could fall on deaf ears. We may all need to dip into our reserve tanks to find manners, grace and empathy during this six-week backspin.Since retrogrades bring back the past, an ex could resurface—for better or worse (or both). If you’ve swept any conflict under the rug, Venus retrograde may force you to deal with it. But careful: Diplomacy and tact are also in short supply now.Venus will split this retrograde cycle between two zodiac signs: Scorpio and Libra. From October 5 to 31, Venus will back through Scorpio and your twelfth house of hidden agendas, closure and healing. You might uncover some shady business or need to figure out what’s real and what’s an illusion. A person you thought was trustworthy could reveal themselves to be anything but. Sagittarius, you may be known for your brutal honesty, but that doesn’t mean you’re above-board about everything. A round of (uncomfortable) true confessions might be the only way to heal a rift with a friend or loved one.This is also a powerful time to practice forgiveness. If you’re holding onto resentment or a grudge, it might be eating away at you. In fact, it could take a toll on your health if you don’t release it for once and for all. Research shows that resentment and bitterness are toxic, causing our systems to release more cortisol, the “fight-or-flight” hormone, and suppress the production of oxytocin, the “bonding hormone.” Do yourself a favor and find a way to let this struggle go! From October 31 to November 16, Venus will backtrack through Libra and your eleventh house of groups and friendship. This could spark discontent in your inner circle, but it could also bring an opportunity to mend fences. The eleventh house rules technology, and with the planet of charm and beauty gone awry, minimize your social media time. Posting caustic comments to a feed or hastily adding selfies? Please don’t. Unless your look is truly #onfleek or you can be sure you won’t offend and alienate anyone, better to hold off. In fact, you’re due for an even longer rest period starting October 23, when the Sun plunks down into Scorpio and your twelfth house of closure, healing and release. This is your annual “sleepy season,” a monthlong time to recharge your batteries and shed a few emotional layers in preparation for your birthday—and Sagittarius season, which begins November 22. Focus on tying up loose ends now rather than starting any huge undertakings. Wellness check! The October 24 Taurus full moon illuminates your sixth house of health, fitness and organization. Before you tuck yourself into bed completely, the celestial spotlight beams onto your practices and habits. Are you being as efficient as you could be? Delegating instead of trying to DIY everything? This full moon will be in close conjunction to shock jock Uranus, which could bring a heap of stress or major shifts all at once. You might decide to make a radical change to your diet, exercise or work routines. Some Sagittarians might suddenly decide to adopt a pet, or you could take on a volunteer project for the holidays. Just be careful not to bite off more than you—or the new furry friend—can chew. The sixth house rules helpful people and employees. This full moon can bring a changing of the guard on Team Sagittarius, or you might decide to suddenly hire or fire. Since Uranus rules technology, you could start working with a virtual assistant or consultant. Incorporate “smart” solutions into your wellness strategy, perhaps with a fitness tracker or an app that monitors your sleep cycles. Halloween could bring out your feisty side. With the moon in Leo and your adventurous, expansive ninth house, you’ll be the life of the party. Pace yourself, though—at the spiked punch bowl and elsewhere. The moon will form a tense square to the Sun in Scorpio and your hypersensitive twelfth house. You could be an emotional sponge or run out of steam sooner than you think…a true dilemma if you happen to be hosting the costume party of the century in your living room. With retrograde Venus and volatile Uranus in a stressful opposition, you could hit a breaking point if you get too frustrated. So head out for some spontaneous fun, but don’t box yourself into anything. When you’ve gotta go, you’ve gotta go!On or off? You’ll be like a flickering light bulb when it comes to love this month. On the one hand, excitable Mars is in Aquarius and your communicative, social third house from September 10 to November 15. You’re in the mood to talk, debate, flirt like a champion and mix it up. If you’re dating, lusty Mars in this variety-loving house could bring a full slate of prospects, some with keeper potential, others just for fun. If you’re considering “dating around,” Mars will give you the confidence to explore a bunch of options.But…oops! The other love planet, romantic Venus, is spending the whole month in Scorpio and your empathic, sensitive twelfth house. With Venus turning retrograde October 5 to November 16—and in Scorpio through October 31—you may feel thin-skinned and insecure. Being vulnerable is good for you, Sagittarius, but you prefer to control the when, where and how. When Venus goes retrograde, however, it could happen when you least expect it. Unresolved conflicts and old baggage could come up since retrogrades turn our attention to the past. That could happen through an ex or via a love situation that opens an ancient hurt, unleashing an outpouring of old hurts. Use this time to heal the core wound instead of just massaging the scar tissue.The tough part of October is that Venus and Mars will be at odds, locking into an exact square (90-degree angle of conflict) on October 10. While Mars prods you out into the social scene or compels you to talk things over, Venus wants you to retreat and lick your wounds. Their agendas are diametrically opposed, and it will be hard to know which one to obey. Mars is seeking direct dialogue and straight answers while an evasive Venus can barely distinguish fact from fantasy. If you’re unclear about whether or not to trust someone, it could take a few weeks to be sure. But don’t simply believe their words. You’ll definitely need to make sure that their actions correspond. Breathe, sit back and observe.  Venus-Uranus opposition Your desperate attempts to micromanage your love life will fall flat, which is a good reason to quit trying! You may be reacting to an old wound that has nothing to do with current time. Before you alienate someone who really cares about you, talk this out with a trusted confidante or therapist. What you don’t know CAN hurt you!Get your geek on this month, while the focused Sun is beaming through Libra and your eleventh house of technology and teamwork until October 23. Are you looking for a way to stay in constant contact with your group or keep track of every stage of a project? There’s an app for that—more like a hundred! It’s worth scouring your App store and reading some reviews to find the perfect piece of software to help you work smarter, not harder. If you need to acquire some new digital skills to keep pace at work, see if your IT department offers training classes or private tutorials. Or, check out online courses with video lessons that help you boost your skills.An exciting opportunity to collaborate on an innovative project or to work with a visionary group could come right around the October 8 Libra new moon. If you’ve been thinking about ways to pool resources lately—and the perfect people to do that with—and this once-a-year lunation could shine the first beam of light on that pathway. You’ll get another cosmic boost in that department this month, with decisive Mars blazing through Aquarius and your interpersonal third house. Seek out people whose skills complement (rather than replicate) your own. If you’re serious about this, don’t waste time mulling. Once the Sun dips into Scorpio and your torpid twelfth house on October 23, you’ll be more interested in R+R than your next big move.But there will be at least one last surge of motivation, when the year’s only Taurus full moon beams a spotlight into your organized, well-oiled sixth house on October 24. That day and for a couple weeks after, you may become obsessed with streamlining, systematizing and dealing with all those details that usually just leave you cross-eyed. With aesthetic Venus reversing through your twelfth house of letting go all month, you may get an urge to purge a TON of clutter, both mental and physical. But don’t throw the good stuff in the garbage. Enjoy the thrill of finding appropriate donors for whom your “trash” will be a treasure. October 2: Mercury-Pluto square Sometimes you have to let democracy rule, even when you’re convinced your way is the better approach. Bite your tongue, and be careful what does slip out today. If people are acting secretive, don’t try to pry intel out of them!''Get to work, Capricorn! Your marching orders come direct from the cosmos while the Sun makes methodical steps through Libra and your structured, ambitious tenth house. As the natural ruler of that realm, Capricorns should truly feel “in the zone,” ready to take last month’s lofty ideas and turn them into concrete goals.The October 8 Libra new moon is especially potent for kicking off a new venture or invigorating your climb toward a professional victory. Not only will you see results unfold over the next six months, but there will be a rare TWO full moons in Libra that correspond with this new moon. Normally there is only one new or full moon per sign each year, but you’ll get a double-header of lunar energy in March and April 2019.You’ll be glad to focus on work because Venus, the planet of love, interpersonal harmony and beauty, will turn retrograde for six weeks on October 5, sowing discontent through your closest ties until November 16. The Celestial Peacekeeper makes this backspin every 18 months, which can cause compassion, manners and generosity to go MIA. Mind your own P’s and Q’s with extra vigilance, and try your best not to clap back at anyone who’s brusque or bitchy toward you. Deep, cleansing breaths, Sea Goat…From October 5 to 31, Venus will back through Scorpio and your eleventh house of teamwork and technology, making it hard to get the Capricorn crew on the same page. Tensions could erupt in your inner circle, or you might feel out of sync with a group. The eleventh house rules technology, so if you’re in need of a social media break, by all means take one. From trolls to bad selfies to that addictive ex pinging you on chat (resist, Capricorn!), your digital life could be rife with temptation AND trouble. It’s a good time to purge your “friends” and “following” lists online and to clean up all your profiles, removing things that don’t reflect the person you are today.Venus will reverse through Libra and your career zone from October 31 to November 16, turning work into a warzone—or at least, not the most comfortable place to hang out. Thinking of dating a coworker or mixing business with pleasure? Proceed with extreme caution. Some old “daddy issues” could resurface while Venus backtracks through your patriarchal tenth house. Do some healing work so you can stop reenacting old dynamics that no longer serve you. On October 23, you can let your hair down again. The Sun enters Scorpio and your social eleventh house for a month, a time to step away from the grind to mingle, network and collaborate. With the holidays approaching, you might get involved in a charitable cause. Your inner activist will wake up now, so pick a world-bettering cause and lend it your efforts. With el Sol in this “detached” zone of your chart, you’ll have better luck stepping back from any “Venus-retrograde problems” and viewing them through a more levelheaded lens.But drop the calm, cool and collected act for (at least) one day of Scorpio season. Your passionate side ignites at the October 24 Taurus full moon, which blooms in your fifth house of self-expression, romance and fame. This once-a-year lunation brings out your full-bodied side, perhaps a lesser-seen facet of you. You could attract attention, possibly without trying, and la luna invites you to unleash the glamorous or showy parts of your personality. Let that inner performer out to play! One of your new fans could have romantic potential—yes, even during Venus retrograde. And if you’ve been giving all your lovin’ to an undeserving person, la luna could remind you just how many (interested) fish are swimming in the sea. Onward and upward!A full moon in this reactive house isn’t always easy, though. This one is conjunct with unpredictable Uranus, which could detonate knee-jerk reactions without notice. Strong emotions can come rushing out, and once the floodgates are open, it won’t be easy to let the drawbridge back down. You might impulsively act on an attraction or blurt out a true confession. (Well, at least it’s out in the open now…) You could also decide to change up your style suddenly with a piercing, tattoo or new hairstyle. Please heed all Venus-retrograde warnings and consider waiting, especially under these impulsive skies. With the Sun and Uranus making their annual opposition today, you might lock into a heated conflict with a friend or lover. Get authentic, but be careful that emotions don’t override your senses.Halloween brings out your sexy side as the moon slinks into Leo and your seductive eighth house. But before you disappear with that hottie in the Zombie Apocalypse getup, make sure you’re not deserting your crew or leaving someone without a wingperson. The moon will form a tense square (90-degree angle of conflict) to the Sun in your group sector. You could feel pressure to go out when you’d rather put in earplugs and turn in early. Don’t force yourself to rally—but if you think being alone could send you down a self-pitying spiral, shake off those heavy vibes and go out for a couple hours. Your mood might make a complete about-face once you get out into the night.Just watch for an opposition between Venus and Uranus, which could bring out unpredictable and dramatic behavior. There may be a few divas to dodge or overblown egos to avoid getting triggered by. No, that’s not a Halloween costume: They really DO act like that the other 364 days of the year. Keep your dignity intact and refuse to engage!Fly free or settle down? You’ll feel tugged in dueling directions this month as the love planets send you volleying between security and freedom. Intensifier Mars is in Aquarius from September 10 to November 15, heating up your second house of security and finances. With the red planet revving the energy, you could feel anxious to lock down a stable commitment. Careful, though: You’ll come across as pushy if you get too much tunnel vision about your agenda.Couples may fight about money, especially if funds are tight after a summer of lavish spending or fielding an unplanned expense. All Capricorns could be feeling the pressure of work or heavy responsibilities weighing on your shoulders, which can cut into romance. Try your best not take that out on your love interest. Instead, indulge in some luxe pampering, alone and together. Head to a chic hotel bar for a drink, get massages or make a candlelight dinner at home. Use your imagination and you’ll come up with plenty of compelling options. So much better than having a blowout about the cell phone bill!But don’t just huddle under a blanket with bae, bingeing on fall TV. Science shows that adrenaline, the neurotransmitter released in response to scary situations—is actually linked to arousal. Jump-start the attraction with a few exciting outdoor activities, such as rock-climbing, hiking through wine country or horseback riding. Follow with a farm-to-table meal or a night at a rustic-chic cabin (avec jacuzzi). Boom—instant mojo reboot!And you’ll need some booster rockets because the other love planet, Venus, will be retrograde from October 5 to November 16. Until October 31, vixen Venus will be sprinting backward through your eleventh house of groups, friends and emotional detachment. As intense as Mars might make you feel, another part of you could have doubts about the future. You might wonder if you’re locking yourself into something too serious too soon or, if your love life has hit a plateau, feeling a bit of cabin fever? This tension can really come to a head on October 10, when Venus and Mars lock into a heated square (90-degree angle of conflict).Venus retrograde could spark temptation from a flirtatious friend or coworker or, since the eleventh house rules technology, draw you into an online liaison with all the trappings of an emotional affair. Is it chatting or cheating? That line can be blurry and, therefore, easy to cross. Before you accept a friend request from an old flame or high school classmate, make sure you’re not in a vulnerable place.  Taurus full moon The year’s only full moon in your passionate fifth house may inspire you to share—or act on—your authentic feelings, which you’ve been keeping under wraps since the corresponding new moon six months ago. Drama can ignite under this intense lunation, so before you go full frontal with your desires, make sure your audience is on-board.Libra season brings its annual wave of motivation to your career, but even if you haven’t hit a bulls-eye yet, don’t give up till you do! From now until October 23, you’re plugged into a solar power surge, but as your patient sign knows, good things are worth waiting (and working) for! One high point could come at the October 8 new moon in Libra, the only one of the year. New moons create opportunities for fresh starts and help you plant seeds that will sprout over the coming six months. This one, in your success sector, could bring an exciting job offer or a shot at a serious leadership position. Let the powers that be know exactly what you’re capable of. If you don’t have anything concrete to show, volunteer to help on one of their high-profile projects and then give ’em your best stuff.Elsewhere in your chart, determined Mars is tearing through Aquarius and your second house of work and money until mid-November, giving you an extra shot of motivation to build a rock-solid financial foundation. But until things settle into place, try not to get stressed if funds are tight. If anything, let that inspire you to push—or tighten the belt—a little more. Keep your eye on your long-range goals: Where do you want to be in two, or five, years? And then remind yourself how to start that journey of a thousand steps.  And don’t underestimate the value of networking! You’ll have some silver-tongued mojo working for you starting on October 9, when articulate communicator Mercury joins social Venus (who’s retrograde) in Scorpio and your eleventh house of teamwork and technology. Feel free to talk shop even outside of work—find folks who are thinking along similar lines or who might need someone with your skill set. It really is about who you know—and how much they respect you!With Venus in reverse, you might reconnect with someone from your past, perhaps a former colleague you always “knew” you were meant to work with again. Even if nothing materializes immediately, keep these ideas in the “active” folder. When the dynamic Sun begins its monthlong journey through Scorpio on October 23, things could happen very quickly.That next day is one to mark in red. The year’s only Taurus full moon illuminates your fifth house of creativity, risk-taking and fame. Something you’ve been working on for the past six months might finally come to an exciting conclusion, perhaps drawing influencers’ attention your way. Or you might need to take a (calculated) gamble to push a project to the next level. Think—and feel—it through, and if you get a strong intuitive “yes,” then go for it! October 2: Mercury-Pluto square Clashes with authority figures? Power struggles at work? Today’s intense dynamics could get you all huffy and haughty and worked up into a lather. Be careful about throwing your weight around. That “don’t you know who I am?” routine could piss off the wrong people. Someone might behave in a secretive or calculating manner. Do some behind-the-scenes investigating, but don’t waste all day—your recon could turn up more questions than answers.: , 6 : 1, 13''Happy birthday season, Libra! The Sun is making its annual voyage through your sign until October 23, handing you the talking stick and inviting you to prioritize your own needs and desires. With el Sol in your first house of image and assertiveness, you’ve got a little extra swagger at your disposal. Use that mojo to propel your own goals now. The October 8 Libra new moon is like your personal new year, a moment to really put your passion projects and starry-eyed ideas into motion. Set intentions for where you’d like to be next spring. There will be a rare double-header of Libra full moons in March and April 2019, so the seeds you plant today could produce a serious bumper crop!While you’ve got plenty to celebrate this month, there’s one notably absent party guest from the #LibraSeason fiesta. That’s your ruling planet, Venus, the galactic goddess of romance and harmony, who’s decided to take a sabbatical from her usual duties of promoting peace and goodwill. She’ll be retrograde from October 5 to November 16, a six-week cycle that happens every 18 months and sends romance and relationships to the repair shop.Venus will back through Scorpio and your second house of work, finances and self-esteem from October 5 to 31. Then on Halloween, she makes a devilish move and backs into Libra for the duration of the retrograde, until November 16. This cycle is notorious for revealing the cracks in the foundation of our relationships—if not full-blown fault lines. While it might feel like an earthquake to some Libras, this is an opportunity to snap out of denial and deal with any part of your past you’ve been sweeping under the rug.Instead of playing the victim or blame game, it would serve you most to look inward to find your own core emotional issue. Were there red flags you missed—or chose to ignore because you were afraid of being alone or embarrassed in public, for example? There’s no excusing anyone’s bad behavior, but you may find empowerment in finding an explanation for why you put up with it.This month, Venus is retrograde in your second house of work, which could spike conflicts with coworkers or drive up anxiety around money. Talking about finances, especially with a romantic partner, could be fraught with tension and the source of serious fights if you don’t approach this gracefully (which will be hard, especially if you’re feeling upset or threatened). You may need the help of a third party, like a coach or counselor, to resolve this.The second house also rules our environment and aesthetics. Your normally spot-on tastes could have an “off” moment. Hold off on any makeovers, whether it’s to your wardrobe, appearance or decor scheme. Long-lasting alterations like tattoos, radical hair changes and impulsive injections definitely get the Venus-retrograde thumbs-down.Is your schedule maxed out and cluttered with half-hearted obligations? This is the perfect time to sift and sort. With Venus rogue in your second house of daily routines, less is more. Take on a grounding practice—just one!—that you can use to offset those dramatic moments. Maybe it’s time to get with the Goat Yoga trend already, Libra? Nah, too complicated to do regularly, so maybe start with a mantra, a guided meditation or breathwork app, or just scaling back that parts of your life that have become too much.That will get easier starting October 23, when the Sun begins its monthlong visit to Scorpio and your grounded second house. You’ll be able to prioritize and focus, perhaps picking a few winning ideas from your birthday resolutions to pursue in earnest.You’ll have an illuminating moment to examine all of that on October 24, when the year’s only Taurus full moon blasts into your eighth house of merging, intimacy and joint ventures. You might be offered an opportunity to blend your superpowers in a shared business project, but be sure to conduct due diligence before you go all in. Legal and real estate matters can be resolved, and since the eighth house rules windfalls, you could receive word of a large lump sum (hopefully being paid TO you, not BY you).This full moon might mark a turning point in a key relationship: Should you stay or should you go? A simmering sexual attraction could reach the point of no return. Longtime couples may venture onto more permanent terrain, such as an engagement, pregnancy or perhaps an official split. Strong emotions can surge up from the depths today, surprising even you. Since this full moon will travel in tandem with shock jock Uranus, today’s events could come with even more of a “curveball” factor.Halloween promises good times since the moon will be in Leo and your eleventh house of group activity. Go blow off steam at a party or pour your stress into creating a prizewinning costume. Try to get ahead of the curve by finishing your work because the moon will receive a harsh beam from the Sun in your industrious second house, indicating that your duties could creep into trick-or-treating hours. Beware a jarring Venus-Uranus opposition that same day that could shake up your self-confidence or bring a romantic surprise you weren’t quite ready for. (“You’re proposing to me while dressed as a character from The Incredibles? Way to kill the romance!”) Your own emotions could be temperamental, so watch those knee-jerk reactions—and stay away from volatile people who seem to be out there looking for a fight.Drama alert! The love planets could leave you feeling shaken AND stirred with their October antics. Not only is your ruling planet, Venus, the galactic guardian of romance, retrograde from October 5 on (more on that in a sec), but spicy Mars is barreling through Aquarius and your passionate fifth house until November 15, putting you in a feisty mood.The red planet’s extra swagger looks good on you, Libra—your sign could always stand an extra jolt of confidence and mojo. And don’t think people aren’t noticing! When Mars visits your fifth house, which happens every two years, you gain instant head-turner status. Thinking of expanding your brood? With virile Mars in this fertile zone, Libras of the childbearing set are on notice: The stork is circling overhead.This is actually Mars’ second visit here this year, but alas, its first round was tainted by a two-month retrograde from June 26 to August 27 (let’s put that behind us, shall we?). Now, you get a do-over, which means a second chance to flaunt your stuff. Your incurably flirtatious sign will soak up the attention. But watch that you don’t overstep bounds (scan the ring fingers, Libra), or you could end up with jealous-diva showdowns. No thanks!Some static may be unavoidable, since Venus, the planet of love, affection and harmony, will be retrograde from October 5 to November 16. Until October 31, it will reverse through Scorpio and your stabilizing second house. As Mars ratchets up the intensity, you may flounder in search of an anchor, which will cause your Libran scales to swing wildly. Coupled Libras could fight over money, household duties or the day-to-day minutiae of your overlapping lives.When Venus and Mars clash in a tense square on October 10, you might be pulled between competing desires for security and freedom. Your own flirting could overstep a boundary with a love interest, leaving them insecure and rattled. Why push that envelope, Libra? Sure, you’re a free agent and you can talk to whomever you want. But what are you trying to accomplish here?In the case of a square, you’re forced to reconcile between dueling needs and agendas. Compromise is essential. While Mars pushes for hot-and-heavy chemistry and envelope-pushing thrills, an already weakened Venus yearns for emotional reassurance and consistency. It’s not exactly easy to get both at once!You might enjoy listening to psychotherapist Esther Perel’s SXSW talk on The Future of Love, Lust and Listening, a fascinating treatise on modern relationships. The greatest challenge of our times, Perel says, is reconciling our fundamental needs for stability and change, adventure and security. You’ll certainly feel this tension at the Venus-Mars square on October 10, so listen up for a thought-provoking new perspective.  Taurus full moon This annual full moon in your intimate, erotic eighth house can churn up some heavy emotions, especially if you’ve been repressing them. Talk it out before you explode! On a more positive note, this moon could bring a pregnancy, engagement—or possibly a breakup. Under this spell, you’re either all in or you’re out!Rise and shine! With the Sun illuminating your sign until October 23, you’ll have a radiant glow to you—which you’re encouraged to use to your advantage! If you’ve been waiting for the perfect moment to launch a new initiative or talk to someone about pooling your talents (both very Libran activities), this is it! Networking can boost any professional venture now, so do what you do best and meet, greet and schmooze like a pro. This is a good month to update your social media profiles and refresh your bio with your most recent accomplishments. One thing to be aware of: Your ruling planet, charm magnet Venus, will be retrograde from October 5 to November 16, and not everyone will be on their best behavior (ahem, present company included). Plan your moves carefully because you could come on too strong or rub people the wrong way—even when you’re TRYING to be pleasant!One of the most exciting days of the year comes on October 8, when the annual Libra new moon stokes the embers in your first house of identity, appearances and self-directed ventures. This is like your own personal new year and gives you a power shot of confidence. Whatever you’re involved in—from job-interviewing to rebranding to organizing groups—do everything in your power to stand out from the pack. People are noticing you, Libra—whether you’re noticing THEM or not!Assisting your rise to the top is impassioned Mars, who’s bringing his unrivaled enthusiasm to your fifth house of creativity, risk-taking and fame until November 15. You’re the consummate team player, but during this Martian power surge, you’re invited to step to the front of the line and accept the praise and rewards that are being proffered. This is no “happy accident.” You’ve been working HARD for this, and when your big moment finally comes, you want to be ready to step into the spotlight. Put some thought into your long-term financial plans at the October 24 Taurus full moon, which lights up your eighth house of wealth and shared resources. How can you do more with all your “assets,” whether they’re actual monetary investments or powerful alliances? You deserve the highest ROI you can get!   October 2: Mercury-Pluto square Buried hostilities might worm their way into your communications today. You could find yourself locked in a tense power struggle that feels like it’s actually about something personal. Don’t be so quick to share about your non-work life with colleagues or clients. Take the icebreakers one careful reveal at a time.: : 4''Time to get anchored, Virgo? With the Sun in Libra and your grounded second house until October 23, you’re ready to start putting those birthday wishes and intentions into action. During this practical solar cycle, you can shift into “builder mode” and get your concepts into concrete form.The second house rules work and money, and you’ll be ripe for new projects or revenue streams, especially at the October 8 Libra new moon, which kicks off a prosperous six-month cycle. If you’re thinking of initiating a new regimen, like eating cleaner or going to a sunrise boot camp, this lunation is the perfect start date. You’ll see the full breadth of your results at the corresponding Libra full moons next March and April. This rare “double-header” in 2019 is very powerful for manifesting, so you’ll want to waste no time getting things off the ground.Staying busy with your day-to-day duties will be a smart strategy for other reasons too. Namely, the planet of peace, love and harmony—Venus—is retrograde from October 5 until November 16. When the Celestial Charm School Headmistress takes her six-week sabbatical every 18 months, our normal levels of compassion, harmony and conflict resolution can go out the window. Relationships are tested, and some can splinter, temporarily or for good. (Just watch for those “Shocking Celebrity Splits!” screaming at you from every headline this month.)The hidden gift of retrograde planets is that they turn our attention to the past. What might you have overlooked, even with that discerning Virgo eye of yours? Did you sweep an issue under the rug, or stuff down feelings about a betrayal or breach of trust? Time may not have healed all wounds, and perhaps there’s some scar tissue that needs a little TLC.Although everyone’s love life could feel the strain, you may feel Venus’ reversal the most with friends and coworkers. From October 5 to 31, Venus will back through Scorpio and your third house of neighbors, siblings and peers. Simply put, the people you normally love hanging out with could work your damn nerves. This phase may put a crimp on your social interactions as Venus retrograde in your communicative sector can make you extra-sensitive about feeling slighted or misunderstood in conversation. Mind your own P’s and Q’s too. Others may feel that you’re being brusque or officious with them if you don’t add those niceties, both in person and on social media. An ounce of prevention is worth a pound of cure.From October 31 to November 16, Venus will back into Libra and your second house of work and money. Couples could fight over finances or feel unsupported with your day-to-day lives. It might help to find out each other’s Love Language so you can give MORE of what your partner (or friend, or client or colleague…) needs to feel safe and supported. For example, if your coworker is a “Words of Affirmation” person, prepare to dole out some extra compliments and encouragement. And if you have to give tough feedback, be sure to deliver it in a “praise sandwich,” where you give the critique in between two positive observations. Is that extra work? Yes, but it could save you hours of drama.When the Sun moves into Scorpio on October 23 and joins Venus retrograde, you’ll get the solar-powered confidence and courage to speak your truth. And vociferous Mercury (your ruling planet) is also in Scorpio from October 9 onward, which can help you choose the right words to convey what’s in your heart. The tension could intensify at first, but at least you’ll get it off your chest, even if it takes a few tries!You could finally hit the mark on October 24, when the year’s only Taurus full moon illuminates your ninth house of soul-baring honesty. With shock jock Uranus traveling in tandem, the truth might set you free—but it could also get messy. (Duck!) And with the ego-driven Sun in opposition to Uranus, a heated conversation may find you throwing low blows at each other. Please, Virgo, spare their dignity and sheathe those verbal daggers of yours. These people know not what they do (or say!), and if you take the bait, you’ll only get dragged down into their low-vibe cesspool.Your best bet? Shift your focus to the big picture and ONLY engage in positive interactions today. Since the ninth house rules global connections, risk-taking and growth, this full moon could bring an utterly magical moment in which one of your gambles pays off or a visionary idea springs to life—and spreads like wildfire. Your hunger for knowledge could be sated by a mind-blowing realization that helps you see a situation from a new perspective. Suddenly everything makes sense. An opportunity to travel could arise out of the blue. Don’t overthink it. Two words: Wheels up!Halloween is an occasion to rest as the moon lingers in Leo and your sleepy twelfth house. At the very least, a slow and sensual vibe will be the speed to aim for. Take in a performance or hit a trance-y dance party—but avoid the raucous revelers at all costs. With the moon and Sun squaring off, you’ll have a lot of invitations, and you’ll feel the #FOMO (or guilt) when you turn the majority of them down. But your self-care and needs come first, Virgo! Besides, with Venus butting heads with unpredictable Uranus today, people will be fickle, flaky and temperamental. The more you push yourself to do something you don’t want to do, the more likely you’ll be to snap. Take it easy and honor what your intuition tells you.The way to your heart is through your head this month, Virgo. The love planets, Venus and Mars, are spending the whole month in the most cerebral zones of your chart. While you’ll be able to connect the dots and see things without a lot of emotional static on the line—a definite plus—you could also fall into an overanalyzing trap, becoming a little TOO detached from your feelings.If you find yourself spinning out in a whirlwind of thoughts, slow down and connect to your body (which will then help you access your emotions) through movement, massage or something sensual and “yin.” Take a break and blast some music—have an impromptu dance party or belt out a ballad in your car. Just keep the energy flowing and get out of your head when you can.Basically, you’re trying to balance the “yang” forces that will be with lusty Mars in Aquarius, stampeding through your cerebral sixth house from September 10 to November 15. This could cause stress levels to spike and draw out your hypercritical side, causing you to home in on every perceived flaw. Your own self-critical side might also be operating at full blast, so please—for everyone’s sake—say nice things about yourself, Virgo! Channel some of that tension into exercise or challenging outdoor adventures. Science shows that physical activity boosts adrenaline while novelty boosts dopamine (the neurotransmitter of excitement and motivation). Both can contribute to major feelings of attraction. So if you want to keep the climate ripe for romance, no matter how long you’ve been together, take a thrilling hike, play some competitive frisbee in the park or go rafting down the rapids. Your journey might just end in the bedroom!This is Mars’ second trip through Aquarius, and it’s kind of a do-over because the red planet was retrograde here from June 26 to August 12—not exactly setting the stage for summer love. This month, Venus takes its turn on the retrograde roller coaster, doing an about-face from October 5 to 31. Until the very last day of October, she’ll reverse through Scorpio and your third house of communication, causing you to feel wildly misunderstood and out-of-sync at moments. When Venus and Mars meet in an exact square on October 10, your verbal warfare could be deadly to intimacy if you’re not careful. True, you may need to air some grievances, but make sure you’re crystal-clear on your talking points—and heed the words of Martin Luther King, Jr., who said, “Love is the only force capable of turning an enemy into a friend.”  Venus-Uranus opposition An innocent conversation could blow up into something confessional, whether you were ready for this or not. Before you try to pry the lid off a potential Pandora’s box, think through how you’d feel if you found some skeletons in there.Hello, peak productivity! During the Libra Sun’s annual parade through your industrious second house (until October 23), you’ll be eager to affix your nose to the grindstone. After a festive birthday month, your hardworking sign recognizes that it’s time to get back to business and make up for some lost time. This solar power surge brings the opportunity to increase your earnings, since the second house governs your finances. Due for a raise? Don’t wait for THEM to offer it. Request a sit-down and remind the decision-makers of everything you’ve accomplished this year. If you work for yourself, it might finally be time to increase your rates.Venus is the “boss” of your second house, and since she’ll shift into reverse on October 5, you might want to make any money moves before then. You could lose your nerve, or the window of opportunity might temporarily slam shut, becoming harder to pry ajar until November 16. Speak now or hold your piece, Virgo! And because she’s traveling through your networking nook, you might find people less amenable to collaborations now. No worries: You can continue to develop and grow your ideas and have them ready to roll once the social director planet gets back on track.But a potent Libra new moon on October 8 can nullify the effects of Venus retrograde, so strike while that lunar iron is hot! New moons plant the seeds for future growth, and initiatives you pursue now could yield a big payday around the corresponding Libra full moons in March and April 2019 (yes, there will be two next year). And with messenger Mercury lighting up your communication corner starting October 9, you’ll know exactly when, if and how often to follow up on things.You won’t let any moss grow on you as you wait for a response, though! Driven Mars is churning through Aquarius and your sixth house of organization, efficiency and hard work until November 15, helping you streamline your routines and get life running like a well-oiled machine. But raise your gaze and widen your perspective on October 24, when the year’s only Taurus full moon powers up your expansive ninth house. Visionary dreaming backed up by practical approaches: That’s the real Virgo superpower!   October 2: Mercury-Pluto square You could catch someone trying to take credit for your hard work today. WTH!? Defend yourself, even if that means filing a formal complaint. But don’t give them any energy in the process. This is about taking ownership of your accomplishments.: 8  9 : 1, 18''Lightness at last? October is one of the liveliest and most social months for you, Leo, as the Sun makes its annual trip through Libra and your communicative third house until October 23. There’s nothing you love more than swapping stories with a kindred spirit (all right, maybe a few things…but it’s still high on the list!) as you share a decadent treat at that buzzy new cafe or window shop for hours. If you’re not talking about everything from your latest favorite TV series and “oh my god you have to try it” organic skincare line to whether life exists on other planets, you’ll be devouring books, podcasts and blogs that feed your need for fresh intel. Hello, hungry lion!And like a true cub, you need to romp and play. Let your inner event planner have a field day during Libra season, hosting little parties or rallying the troops for excursions. Hit the fall festivals and gather your friends (and their friends) to check out new hotspots in your ‘hood.The October 8 Libra new moon is an especially prime day to spark up a new friendship or have an important conversation. If you’re pitching a creative concept or meeting a would-be client, these moonbeams will give you the gift of gab, so schedule your appointments accordingly. (This one falls on a Monday, FYI.)Just make sure you have all your facts and figures straight. A loose square from deep-digging Pluto in your analytical sixth house reminds you not to simply rely on charm, wit or popularity here. Someone could fast-pitch unexpected questions that you’ll want to be prepared to answer. And if you’re not, simply tell them, “Let me find out and get back to you.” but by all means, do NOT fudge the truth. Your credibility is too precious to risk.Your vibrant social life will be a welcome distraction from October’s most challenging transit, which will attempt to disrupt the happy-go-lucky vibes. Venus, the planet of love and interpersonal relations, will be retrograde from October 5 until November 16. While the Celestial Headmistress of Harmony is on sabbatical, people can become rude, cranky, ungracious and self-centered. Compassion flies out the window, and conflict can skyrocket. It will take vigilance and conscious effort not to get sucked into petty arguments or clap back when someone gets nasty with you. Venus, which has a retrograde spell every 18 months, will reverse through Scorpio and your fourth house of home, family and heartfelt emotions until October 31, raising a ruckus under your roof or making you especially thin-skinned and moody.  Then it will back into Libra and your communicative third house from October 31 to November 16, which could cause discord among friends, siblings and neighbors.This month’s Venus retrograde sounds the call to patch up any tension with family members, female relatives in particular (hello “mama drama”!). If you’re considering a home renovation or decor overhaul, take baby steps. Venus is the planet of beauty and style, and your normally impeccable taste could fail you. Collect the paint swatches and fabric samples, take measurements, but wait until next month before you spring for that jewel-toned sectional or paint the living room ochre. Something you adored on Pinterest could become the bane of your existence IRL. While Venus retrograde can make Leos (and TBH, all of us) act unusually needy and greedy, those diva demands will wear out your welcome if you lodge too many of them. On October 23, the Sun (your celestial guardian) moves into Scorpio and your foundational fourth house. Hopefully this will give you some solar-powered support while Venus acts out like Mariah Carey in an unfurnished dressing room on New Year’s Eve. Or it could intensify the call to action of Venus retrograde, prompting you to get some proper support and outlets for potent emotions. What DO you need to feel like you’re anchored and secure, Leo? This is a worthy exploration. You can be incredibly self-sufficient, but just because you CAN do it all yourself doesn’t mean you should.Take a break from all the personal-life stuff on October 24, when the year’s only full moon in Taurus beams into your tenth house of career, leadership and success. You could reach a professional pinnacle where you’re recognized for your talents and hard work. If you’ve been pondering whether to cut ties and move elsewhere, this full moon will light the way. And with detached Uranus, the planet of sudden change, aligned with la luna, you have cosmic permission to set your emotions aside and focus exclusively on your goal (at least for one day).That doesn’t mean people will rush to support you—in fact, with the Sun and Uranus in opposition, they might disrupt your attempts to create boundaries by staging a pseudo-crisis and asking you to jump in for the save. Refuse and resist unless it’s a true emergency. This full moon reminds you that it’s time to start acting like the chief of staff, not the emotional paramedic. What do YOU want for yourself and your future, Leo? Well, the only way to get there is to make that a priority and to reduce the distractions that scatter your energy elsewhere. If that means you need to cut off a few needy adult dependents or get some proper help with children or household responsibilities, do it.Halloween hands you the costume party crown if you choose to don it. The moon will be in your sign, making you feel frisky and festive. However, its square to the Sun in your domestic zone could make it challenging to get out of the house or convince people to join in on your hijinks. If you have to venture out to the festivities alone, so be it. Just take proper safety precautions and make sure somebody knows your coordinates since the energy of this night can always be a little off-center. With Venus and Uranus opposing each other today and Venus backing into Libra and your social zone, other people can’t be relied on for much except fickleness. Don’t invite anyone to join you out of pity or obligation—no mercy dates, romantic or platonic!Feelings…nothing more than feelings? Your sensitivity meter is dialed all the way up in matters of the heart this month. Venus, the astrological arbiter of amour, is in Scorpio and your fourth house of emotional foundations until October 31. Normally, that would mean lots of nesting, bonding and (for interested Leos) babymaking or family-planning stuff.But on October 5, Venus will shift into a six-week retrograde backspin, a challenging cycle that dredges up the past—from old emotional wounds to former flames looking to engage again. Tread lightly with all of it during this vulnerable time, as your heart may need some extra protection. Couples might fight about the topic of children or moving in together, or you could simply work each other’s nerves if you spend too much time under the same roof. On the other hand, teaming up for a Marie Kondo-style decluttering mission might be a worthy use of this retrograde. That is, until you start viciously sparring over whether to keep the velvet armchair or give it to your sister-in-law. That entitled slacker has had her greedy eye on it forever…and what has she ever done for YOU, come to think of it? Let her buy her own damn furniture and learn some responsibility! [Insert door-slamming sound effect here.]We already endured the other love planet’s retrograde all summer, when intensifier Mars made a U-turn from June 26 until August 27, spending the bulk of its backspin in Aquarius and your seventh house of committed partnerships. If you had second thoughts about someone or unresolved tension with an ex, the red-blooded planet could have blown that up. Now Mars is making a second (retrograde-free) trip through Aquarius from September 10 until November 15, which could inspire you to move swiftly and decisively into a happily-ever-after situation…or to cut ties and uplevel to a better match.Mars in Aquarius might help offset some of those wayward Venus vibes, or you may be forced to reckon with what you really and truly want in your heart. Conflict could reach a head on October 10, when Venus and Mars lock into a rare and combative square (90-degree angle of tension), made all the more heated because both planets are in stubborn “fixed” signs.You might need to make an important decision or finally address an issue that has prevented you from fully opening up to someone. Talking honestly about your needs doesn’t have to drive a wedge between you. In fact, what REALLY damages intimacy is when you stuff your feelings down. Although there may be some charged moments when you need to breathe or call a time-out, building a safe space to be honest and direct will sustain any relationship for the long haul. October 8: Libra new moon Normally your slogan is “show me, don’t tell me,” but an articulate Libra new moon in your communication center inspires you to share from the heart—and even gush! Singles will enjoy flirty banter and talking about their erotic adventures. Couples who are feeling a little, uh, bored in the boudoir can turn up the heat with some sexy pillow talk. Maybe play the “Here’s something I never told you” game…Get out and circulate! For the first three weeks of the month, the confident Sun is blazing through Libra and your social third house, lending you wit, charm and the gift of gab, which together can spark synergies everywhere you turn. This is a great time to become a regular on the industry networking scene. Putting yourself out there more and surrounding yourself with people on your wavelength could lead to some exciting strategic alliances. Looking to take a personal project public? Talk to your own well-connected circle of connections first and see who’s game.A perfect opportunity for that may present itself on October 8, when the Libra new moon powers up this interpersonal sector. Any “boundary” between friend (or sibling) and business partner may be in your head, Leo. Why NOT collaborate with someone you love spending time with? As long as you share a work ethic and are crystal-clear about responsibilities and profit division, this could be the ultimate win-win situation.  The line between social and business blurs even more as driven Mars spirals through collaborative Aquarius and your partnership house until November 15. The urge to merge will be strong in all areas of life, and if you sense the potential for a mutually beneficial work alliance, pursue it with the passion that only Mars can bring. Just manage your expectations and don’t feel like you have to rush into inking a contract (or any deal) before you’ve had a chance to do all the necessary background checks. The red planet will dial up your enthusiasm but also the pressure. October 24’s Taurus full moon could lift efforts of the past six months to a culmination point, bringing recognition for your hard work. And with game-changing Uranus astride la luna, things could shift in a heartbeat. Do you know what your next big goal is? Take your curtain call or victory lap, but then get back to work and plotting your next big coup.   October 2: Mercury-Pluto square Honesty isn’t your best policy today—you need to play more defense than offense. Guard your cards and listen closely to what others say. And pay attention to their body language: Are they avoiding your glance, shifting in their seat, acting twitchy? Hold off on any deals under these furtive skies.: 1 : 6, 20''All the feelings! The emotion ocean is reaching high tide this October, with a few extra currents pulling you this way and that. For starters, the Sun is in Libra and your sentimental, sensitive fourth house until October 23, which always puts you in a nostalgic state.As the natural ruler of the zodiac’s fourth house, you’re usually “in the zone” during Libra season as el Sol travels through the foundation of your solar chart and draws out your nurturing and domestic side. Your attention is focused on your family or domicile as the Sun illuminates this most personal part of your life. Ambitious plans and worldly duties can wait. You’ve got root vegetables roasting in the oven and a “vintage botanicals” Pinterest board underway. (Priorities, people!) The October 8 Libra new moon will open a new six-month chapter for matters of home and heart, so use these moonbeams to turn to a fresh page with loved ones or to scout for a new address or living situation if you’re in the market for that.It all sounds lovely, but alas, starting October 5, harmonious Venus will throw static onto the line. The planet of love, beauty and bonding will turn retrograde and stay that way until November 16, disrupting your bliss bubble and making you feel more “touchy” than “feely.”This six-week cycle, which happens every 18 months, is notorious for bringing relationship fissures to our attention and forcing us to deal with them. To be blunt: People aren’t always very nice during Venus retrograde. Manners, compassion and grace can go out the window when the Venus, the headmistress of Celestial Charm School, decides to take her sabbatical (why Venus, WHY?). Headlines blare with news of “shocking celebrity splits!” Exes creep out of the woodwork to tempt, confuse or enrage us. And your own tightest ties can start to unravel under the pressure.Venus will retrograde through Scorpio and your fifth house of romance, passion and self-expression until October 31, then it will reverse into Libra and your domestic fourth house for the duration. This month could prompt a serious romantic review. Old tensions could flare in a relationship, or you might have second thoughts about a partnership and the direction it’s taking. Use this Venusian backspin to learn more about your triggers and unconscious patterns. We’ve recently been devouring the book Why We Love by neuroscientist Helen Fisher. If you’re still smarting from a breakup or avoiding abandonment (or blocking intimacy by nursing some other old wound), understanding “your brain on love” could help you feel confident trying again or taking a new approach.You’ll get some solar-powered support starting October 23, when the bold Sun also enters Scorpio, staying for a month. This could intensify the energy of Venus retrograde, so be prepared for a few emotional fireworks or colorful outbursts. Artistic Venus’ retrograde could inspire you to return to an old hobby or resurrect a love of music, art, dance or performing. Shyness? Whatever! The Sun’s visit to your expressive fifth house could give you the confidence and charisma to put it all out there, whether you wear one of your own knitted cardigans—or your heart on your sleeve.If things get a little TOO intense—or Venus retrograde blows up a situation that’s spiraled out of control—you can take a huge step back at the October 24 Taurus full moon. La luna lands in your eleventh house of objective thinking, groups and emotional detachment, helping you pull back from the heat zone and cool down. This full moon will be traveling in close contact with Uranus, the planet of sudden changes, so you might even make an abrupt break. (Exit that drama, stage left!) But since volatile Uranus will be opposite the ego-driven Sun, don’t expect your swift moves to go unnoticed. As you consciously choose to remove yourself from someone’s power games, they might redouble their efforts to pull you in. Refuse and resist, Cancer!On a positive note, this full moon could bring an exciting opportunity to collaborate, perhaps with someone you meet online or through a cutting-edge community project with a social justice twist. You could connect with a like-minded group of people or discover firsthand how much power there is in numbers. Since full moons can bring endings or transitions, you may part ways with a friend or clique and start hanging out with people who are more on your wavelength.Halloween gets a touch of class this year, as the Leo moon beams into your sophisticated second house. Dodge the raucous parties and costumed kiddies and opt for an upscale celebration. You could skip the festivities altogether and work late—or hit a charity costume ball while the moon boosts your money mojo. Just watch for drama among friends and lovers because Venus in your reactive fifth house will lock into a tense opposition with unpredictable Uranus in your social sector. Jealousy, erratic behavior and selfishness could charge the atmosphere, and with Venus retrograde dipping back into Libra later that day, a few ghosts of your romantic past—or skeletons from your emotional closet—might make an unceremonious appearance. Forget about putting on a costume; just keep it real.   Get ready for an intense month! Love planets Mars and Venus are circulating through the most passionate and intimate zones of your chart this October, and that could stir up quite a lot in your tender Cancer heart. Romance-aholic Venus is in Scorpio and your fifth house of amour until October 31, and she’s in a tricky retrograde from October 5 to November 16. You’re walking near quicksand, Cancer, so keep your wits about you to avoid being sucked into a situation that doesn’t serve your highest good.Since retrogrades bring back the past, an ex could resurface, or you might be tempted to get hot and heavy with an attractive but totally #complicated person. Emotions you haven’t voiced could come rushing out all at once. While it’s good to get things out in the open, your perspective could be a bit skewed by Venus’ backspin. Small issues could balloon into big fights if you’re not careful.The drama is that much more alluring because spicy Mars is spending the entire month in Aquarius and your eighth house of merging and secrets. This Mars cycle, which runs from September 10 to November 15, could rouse a jealous or possessive streak, especially on October 10, when Venus and Mars lock into a fraught square (90-degree angle of tension). Loss of perspective much? With both planets in stubborn “fixed” signs, it will be hard to reach compromise or clarity. Beware that your emotions and reactions may be extreme today, so try not to let them overtake you (tough for a sensitive Cancer, we know!). If you have a legitimate need from your partner or love interest, identify it first before launching into a heated conversation about THAT issue.Has there been some shady-ish business going on in a relationship? Gather the facts before you lash out or fling accusations. And if you feel backed into a corner by someone, you might just have to call a time-out rather than engage. If you can’t be your highest self, better not to go there at all! October 2: Mercury-Pluto square You might have the urge to merge, but for your own protection, don’t reveal your whole hand to someone until they’ve earned your trust. Be mindful of what you say—and how you say it—to avoid accidentally poking sensitive spots and provoking unnecessary drama.Don’t be short-sighted when it comes to your finances this month, Crab. Motivated Mars is blazing through humanitarian Aquarius and your house of wealth and shared resources: This is a great time to review exactly what companies your portfolio is invested in and make sure you’re comfortable with that. Mutual funds are by definition diverse, but that might include certain brands or even industries that your compassionate sign doesn’t support. If that is the case, talk to a financial planner and see what the alternatives are. Some Cancers might want to join an investing group or discuss pooling your funds with your partner. And when Mars makes a tense but action-driven connection with inventive Venus in your creative sector on October 10, you might find a way to monetize one of your talents. As they say, if you love what you do for a living, you’ll never “work” a day in your life!With the hot-blooded planet in this zone, you might feel stress from a big upcoming expense or a large lump sum that suddenly needs to be paid out. If you have to have a serious talk with someone about shared finances and resources, the best way to handle it is to be direct. Beating around the bush or soft-pedaling a serious issue won’t do anyone any good. And should an exciting opportunity to make good money fast come up, pour your energy into it—but not to the point that you exhaust yourself. On October 24, the year’s only full moon in Taurus electrifies your eleventh house of networking and group activity. Have you been brainstorming a big idea or trying to get a collaborative effort off the ground? Give it a big push today, and make sure everyone’s on the same page. With radical and rash Uranus alongside the moon, things could gain momentum quickly, and this is something you definitely want to be ready for!    Mercury-Uranus opposition It’ll be easy to blurt under this loose-lipped face-off, but resist! It’s essential that you think before you speak because a slip of the tongue could be costly. Stay focused and conscious: Conversations may become upsetting quickly, with people lashing out and making critical, mean-spirited remarks. Don’t stoop to their level!: 0 : 3, 18''Time is money, Sagittarius—but earning your fortune doesn’t have to be a laborious experience. This Tuesday, October 2, the quarter moon in security-minded Cancer illuminates your eighth house of investments. What if you could work smarter instead of harder? Your sign loves a challenge, but you can get addicted to the hard work and hustle. Lift your nose from the grindstone and strategize. If you were willing to be a liiiiittle more hands-off, could this job be done with greater efficiency? As the saying goes, “measure once, cut twice.” We know your independent sign likes to customize, but are you tired yet? Instead of constantly reinventing the wheel, create a blueprint that can be used for production. Or maybe you could put your hard-earned salary into a more diversified portfolio of mutual funds and even real estate—things that grow in value over time. If this is all Greek to you, download a personal finance book or sit down with a savvy friend or relative who can guide you. Already got your funds flowing into investments? Check up on them to make sure everything is copacetic. It might be time to meet with a broker who can advise on your choices. On Friday, Venus slips into a six-week retrograde. Until October 31, the planet of love and beauty retreats through Scorpio and your 12th house of boundaries, healing and forgiveness. (After that, she rappels down through Libra for the remainder of the retrograde.) Use the rest of this month to do some heart healing. Did you recently weather a breakup, loss or a disappointing experience in life? You may realize that it’s time to say a final farewell or put up an uncrossable boundary. Swaddle yourself in support for this process—but get ready for a deluge of feelings. Your heart may take a little longer than your head to resolve this, so when it comes to your emotions, don’t push yourself to “get over it” faster than is humanly possible. Here’s an uncommon idea: Create a mourning ritual for moving through the pain. What parts of this person or situation will you always love (and really miss for a while)? Set up a temporary altar with photos or objects, allowing yourself to feel the grief fully as you sit before it. By October 31, you might even be ready to build a fire and do a ceremonial burning of a few of those mementos—or else pack them away in storage. If visual evidence of the past is too triggering, as an alternative you could set aside a block of time each day to read healing books, journal about the loss, and give your emotions space to unleash. The fastest way to get over hurt is to go through it fully. Trust that you’ll return to your authentic happiness (not the false cheer) once you allow yourself to plunge into the shadows. And what better time for a descent than when Venus is in Scorpio and your twelfth house, both associated with the underworld?Coupled Archers won’t be able to sweep issues under the rug. And why should you? This Venus retrograde can bring some incredible insights for you both. Get thee to a couples’ therapy appointment or find another outlet where you can work together to heal issues and support one another through your self-discoveries. Single? The colored lens trend might be huge right now but keep the rose-colored glasses OFF your fall shopping list. Venus’ backspin can skew your judgment and even lure you towards the troubled types, even old hookups who seized your heart, then ghosted because they weren’t “ready” (or some other manufactured excuse). If there’s any must-have accessory for the season, it’s a levelheaded wing(wo)man on your arm who can snap you back to reality before you race off trying to rescue a wounded bird. Retrogrades can act as do-overs, too. If you ended a connection prematurely, you may get a second chance with your ex between now and November 16. Check in with yourself first: Is this “Let’s make it work” urge coming from a true desire or a fear that you may never find anyone else? Some Archers might be better off taking a little time out from dating until mid-November so you can get centered in your own power again.: 3 : 9, 11''Ready to bring those crisp edges back, Bull? Prepare to optimize your life as the Libra Sun activates your healthy, organized sixth house until October 23. As a methodical earth sign, you really do function best with a simple, streamlined routine, and this month gives you ideal conditions for creating that. Chaos will fade (mostly) into the rearview as you plan and prioritize. Pinpoint the parts of your life that have gotten unwieldy—then delegate, declutter or dive in for a cleanup mission.The Libra new moon on October 8 is particularly prime for starting a new habit, work project or wellness practice. With holiday hedonism on the horizon, regular exercise and clean eating will help balance out the impending temptations that will be way too good to resist. Want to get more in tune with the rhythms of your spending patterns, health and time management? There’s an app for that; install a few! The sixth house rules service, so look for volunteer opportunities or initiate a giving drive at work. Bonus points if you round up a few friends and turn your do-gooding into a social occasion. Since pets also fall under this new moon’s domain, pay attention to the unconditionally loving critters in your life. If you’re thinking of adopting, start your search!All of this grounding (if unsexy) stuff will have a secondary benefit: to distract you from your ruling planet, Venus, turning retrograde October 5 to November 16. The galactic guardian of love, sensuality and harmony shifts gears for six weeks every 18 months, a time when humanity’s graciousness can go AWOL. Venus will reverse through Scorpio and your seventh house of partnerships until October 31, then it will back into Libra and your sixth house of work and wellness for the duration.This month, you could struggle to feel in sync with your closest peeps, especially in love. But don’t despair: repair! Take this as a cosmic cue to lean in closer and make some proactive changes. Direct communication is always good, but with gentle Venus on the lam, you’ll want to don a pair of kid gloves before you start ladling out the truth serum. For some Bulls, a little separation might be the only thing that helps one or both of you cool down and regain perspective. Retrogrades are notorious for bringing back people from the past, and you could see an old flame or work rival resurface. What might this person have to teach or reflect back to you, Taurus? Professionally, this could be a tricky time if you’re negotiating contracts or working on a joint project. The other party could seem ruthless, rude or fickle. Take your time and make sure everyone is being treated humanely.Luckily, you’ll get a bit of cosmic counterbalance starting October 23, when the Sun enters Scorpio and your zone of dynamic duos for a month. Forget about using that old “Screw people—I’ll just do it all myself!” strategy. The stars will insist that you encircle yourself with a few true-blue souls who have your back through it all. (You may need each other for a little extra support if Venus retrograde starts acting up!)In the midst of any interpersonal drama, the stars will cut through with a blaring PSA: You’re awesome, Taurus! That message blasts over the lunar loudspeaker on October 24 as the year’s only Taurus full moon casts its brightest beams on your first house of self and independence. If you’ve been focusing too much on what THEY did/said/thought, switch to your front-facing mental camera and put all that attention back on yourself. A big idea that’s been percolating since your birthday could also come together powerfully, perhaps with some public recognition and applause. If you’ve been letting others lean too heavily on you or have been putting their needs before your own, don’t be surprised if you get a surge of righteous anger that prompts you to (finally) say, “Enough!” If you celebrate Halloween on October 31, be aware that the night could get a bit intense. With the moon in Leo and your sensitive, domestic fourth house, you might opt for a chill house party (or pass out candy to the tiny revelers) since you’ll be a bit of an emotional sponge, especially with the moon in a testy square (90-degree angle) to the Sun. Venus, still retrograde, will also make a jarring opposition to unpredictable Uranus in Taurus before backing into Libra and your skittish sixth house in November. Under these impulsive skies, your moods could be extra temperamental, so if you do venture out, make sure you feel grounded and supported.It ain’t over till it’s over? This month, the past could circle around as love and romance planet Venus turns retrograde from October 5 to November 16. This tricky six-week cycle, which happens every 18 months, is a time for relationship review and reflection. Are you on the right path when it comes to seeking or nurturing love? Is your heart fully in your current situation? Do you have unresolved stuff still in the space, like unspoken resentment or an unexpressed need? That could all come rushing out, ready or not.Since Venus is your ruling planet, you may be more affected by its backspins than other signs. This time, it will retrograde through Scorpio and your committed-relationship house until October 31, then it will back into Libra and your orderly sixth house until turning direct (forward) on November 16.This month, Venus could bring an ex back into your orbit or turn your thoughts to a former relationship that needs closure. Where do you have baggage that hasn’t been handled? Couples could bicker more often or feel a dissonance as harmonious Venus goes adrift. In more extreme cases, Venus retrograde can prompt you to end a going-nowhere relationship or to finally address a sticking point that’s kept you from progressing. If you’ve been obsessing over a lost love, this Venus cycle could help you finally accept an ending and release your grip on the past so you can start moving forward again.But what DO you want, Taurus? With driven Mars in Aquarius and your goal-oriented tenth house all month, your heart isn’t the only metric for decision-making. No matter how much you adore someone, if your efforts to create a shared long-term life together are constantly thwarted, it will be hard to keep the good vibes flowing. Is it time to adopt a “no more excuses” policy? (Hint: probably!)With Mars heating up your career sector, your busy work schedule could also distract you from romance—which might actually be a good thing while Venus is retrograde. But if you’re dealing with drama both at work and in your personal life, that could take you to the edge.That tension reaches a peak on October 10, when Venus and Mars lock into yet another of this year’s heated squares, a month after their prior one. With both love planets in stubborn fixed signs, you could not only feel pulled between polarizing interests, but it may be hard to get anyone to compromise.Luckily, you’ll have articulate Mercury in Scorpio and your partnership house from October 9 to 31 to mitigate some of the Venus drama and help you put those complicated feelings into words (or an email that you “save to Draft” and sleep on first!). Try to use “active listening” techniques, including letting people speak without interrupting (or assuming you know what they’re going to say next) and mirroring back what they’ve said so they feel heard. If you need the same in return, set up ground rules before you have any tough discussions to keep things civil between you.    Sun-Uranus opposition Compromise doesn’t have to mean giving up too much. When these fierce planetary forces face off, no one wants to budge. The choice is yours: Stay locked in a stalemate or be the one to make the first concession.Ready for a career coup? You may finally feel like you’re making serious headway on a professional ambition this month, when driven Mars returns to Aquarius after a teaser of a visit from mid-May to mid-August—and most of THAT time, it was in reverse. You might have felt you going nowhere fast! But now the action planet will heat things up in your tenth house of success and public image until November 15. You’ll have the motivation AND the energy. Just add a clear goal and the sky’s the limit!Note that Mars can also heap on the tension, so as demands and deadlines intensify, make sure you have a healthy outlet for stress. Because the red-blooded planet will push you to “work smarter, not harder,” you need to stay focused on your most important objectives instead of getting lost in the weeds. Adopting a strong sense of leadership will get you through—and earn you major respect.Lending support is the Sun in Libra and your sixth house of organization and efficiency. A good practice between now and October 23 would be to simplify all your systems and delegate everything that doesn’t require your personal input. If you only have one day to devote to that, make it October 8, when the annual Libra new moon turbo-charges this realm and offers the opportunity for all kinds of fresh starts. Seeds planted then will get a little extra cosmic fertilizer!One thing to watch out for is pseudo-allies who actually DON’T have your back. With your ruling planet, cooperative Venus, spinning backward in your partnership corner from October 5 to November 16, your normally sharp antennae may be a little rusty. To be safe, avoid anyone who can’t (or won’t) give you a direct answer or always seem to whip up drama and distraction. Don’t assume a deal is done until the ink is dry. If things stall, rather than get frustrated, use that time to do a little more due diligence on this thing so that when Venus resumes forward motion, you can hit the gas and GO!  Sun-Pluto square The devil is in the details, and yet obsessing over them will make your life a living hell. Sometimes a cigar is just a cigar, Taurus, so don’t go looking for clues or jumping to hasty conclusions unless you WANT to court trouble.: 6 : , 13''Partnerships for the win…or the draw? October’s major focus is on your closest interpersonal ties. Does everything feel smooth and equitable between you? And even if it does, where might you grow and improve as a duo? The Sun spends all month in your companionship houses (yay for that), pulling supportive people your way and reminding you that no matter how fiercely independent you are, you can always go further when you cooperate.But…that kumbaya concept gets complicated this year. On October 5, Venus, the guardian of love and harmony, will back into a six-week retrograde that could disrupt the balance of your bonds. It feels par for the 2018 course, where a lot of the hopeful transits have also included a disclaimer (“but you’ll also need to watch out for…”).Let’s start with the positive stuff: Setting the template for togetherness, the Sun is making its annual journey through Libra and your seventh house of companionship, commitment and mutuality until October 23. After that, it will plunge into Scorpio and your eighth house of merging, which could take your connection to a deep and permanent place.The October 8 Libra new moon opens a six-month window to explore a stronger union. Hello, dynamic duos! The seventh house is the realm of committed relationships, and during the first three weeks of October, a budding business or romantic partnership could move into “official” terrain. If you’re already part of a solid alliance, it’s a great time to get yourselves back in sync and to plan more meaningful one-on-one time together.How’s the balance of give-and-take in your life? Take inventory. If you notice that you’re surrounded by a lot of supportive people, use this new moon to express gratitude (and return the gesture!). On the flip side, you might be shocked to admit how FEW people seem to have your back, which begs the question: Have you fallen into playing the Aries hero or savior role? If so, start shifting to a more mutual dynamic (step one: ASK for what you need!) and disentangling yourself from draining ties.Libra is your opposite sign, so you’ll be out of your individualistic Aries element this month, and that can feel a bit disorienting. With the enlivening Sun so far away on the zodiac wheel, your life force energy can be low at moments, leading to burnout if you try to do everything yourself. Ding-ding-ding! The solution is written in the stars for you. Libra season urges you to cooperate, collaborate and delegate, and to seek out complementary “equals” who can assist you on your mission. Just watch out for a possible power struggle on October 12, when the Sun and Pluto go mano-a-mano in the second of their two annual squares, which could dredge up anything from daddy issues to manipulative agendas.This brings us to the aforementioned Venus retrograde, the love planet’s challenging six-week backspin that happens every 18 months. This go-round, you’re in the hot seat as Venus reverses through Scorpio and your intimate eighth house from October 5 to 31 before backflipping into Libra and your partnership sector until November 16. You’ll become acutely aware of any flaws in the foundation of your closest ties or of ways you might shift your own attitude and approach to partnership. Relationships can be tested during Venus retrograde (stay tuned for the “shocking celebrity splits!” headlines), and this can be an important time to do repair work, perhaps through therapy or a trial separation. If you’ve drifted out of alignment with someone, Venus retrograde can actually be a helpful time to get back on the same page. Working with a counselor or coach could reveal the root of key sticking points. Single Aries could get an eye-opening view of the blocks you have around commitment, and work toward dismantling them.Retrogrades are designed to put us in touch with the past—sort of like a review period or an audit. Where have you swept something under the rug, left unfinished business or skipped over an essential part of the puzzle? An ex could resurface, or you might decide to give a one time love another chance. Proceed with caution during the retrograde—it might be that your timing is finally right, but it could also mean that you simply didn’t learn an important lesson the first time around.You’ll have a chance to delve deeply into ALL of that starting October 23, when the Sun begins a monthlong voyage through Scorpio and your intimate, inquisitive eighth house. Put on your  “love detective” hat and go into the weeds during this sharp-minded solar cycle. With the Sun in this private sector of your chart, you’ll crave more time alone (possibly with the company of a scintillating plus-one), and your moods can be a force of nature. Tune out distractions if you’re working on a big project because you can make incredible headway with quiet, focused time.The next day, October 24, brings the year’s only Taurus full moon in your second house of work, money and security—some stabilizing moonbeams that you’ll be oh-so thankful for. A work project or goal you’ve been hustling toward since the May 15 Taurus new moon could come together with a profitable flourish. It’s also a great day to step back and take stock of everything from your budget to your daily routines. Before the holidays kick in, is there anything you could put in place to help you stay grounded and healthy? It takes three weeks to form a habit, and you’ve got about that much time until the Christmas carols start piping through every store’s sound system and everyone starts passing around the sugary treats and seasonal cocktails.Before you root in to any new regimens, do a little creative brainstorming. This new moon is traveling in a close conjunction with changemaker Uranus, urging you to think outside the box. How can you use technology or take an innovative approach to your finances, work or another area of life you’re trying to improve?Also on October 24, the Sun and Uranus will form their once-a-year opposition, a tense aspect that can bring out volatile tempers, egos and buried anger. Trying to change everything at once could push you to the brink of burnout. Pace yourself, Aries—hard as that is for you to do. But if you feel like a person in an authority role (e.g., a boss, a doctor, a teacher) is moving too slowly, abusing their power or not serving your needs, DO speak up. Sometimes, reaching a breaking point is a good thing. Just be mindful of your delivery!Channel some of that pent-up energy into your Halloween plans. This year’s frightfest will feature a Leo moon in your flamboyant fifth house, sounding the call for costumes and cavorting—perhaps with a side of frisky fun, since your romance sector is on fire. But watch for a jealous beam from the Scorpio Sun (which will be in conflict with la luna) and from retrograde Venus, which will form a polarizing opposition to combustible Uranus before backing out of Scorpio and into Libra. You or a fellow reveler might get a little competitive or possessive if one of you starts attracting attention. Ugh! By all means, do NOT tone down your authentic self, but if you’re bringing bae to the soiree, make sure everyone is feeling grounded and secure before you head out into the wild night.This month’s love landscape will require some stealthy navigating. Venus, the planet of romance and interpersonal harmony, is retrograde from October 5 to November 16. This transit, which happens every 18 months and lasts six weeks, can test even the most rock-solid relationships. For you, this particular Venus retrograde will split its time between Scorpio and Libra, touching down in your most committed sectors. While this could mean trouble in paradise, Venus retrograde also grants you a chance to correct any imbalances and do the healing repair work.Until October 31, Venus will backtrack through Scorpio and your eighth house of merging, intimacy and sex, giving you second thoughts about how far you want to go in—or maybe a second chance to connect with someone if it didn’t work out the first time! Venus’ backslide through this hyper-vigilant house can brew up stormy feelings of jealousy, possessiveness and distrust. But is it them…or is it you? If you’re still holding onto some old resentments, this Venus retrograde can help you dismantle the self-protective armor that’s keeping love away.Meanwhile, your randy ruler, Mars, is in Aquarius and your eleventh house of groups and emotional detachment all month. This could potentially help diffuse the intensity of Venus retrograde, giving you the ability to step back from heated situations or jumbled emotions. Friends could become lovers—or at least ardent admirers—with magnetic Mars in this social part of your chart. That’s all good, except that this attention-scattering energy will be in direct competition with Venus’ relentless campaign to promote bonding and deep connections.That tension reaches a peak on October 10, when Venus and Mars lock into yet another of this year’s heated squares, a month after their prior one. With both of the love planets in stubborn fixed signs, you could not only feel pulled between divergent interests, it will be hard to get anyone to compromise. Venus wants depth, Mars wants breadth! This square could cause you (or someone else) to run hot and cold, going all the way in one minute then cutting off the flow of feelings the next. You might leap into a no-strings fling or flirtation only to find yourself getting shockingly attached. Or your scintillating passion could suddenly cool (warning: boudoir temperatures could make a sudden drop!).For you, this Venus-Mars square sounds the call to balance head and heart and cool logic with all-consuming emotions. You don’t want to step entirely back from your passions and raw feelings, but a little objectivity will go far. Careful about venting to friends or hinting at drama on social media, as your private confessions could become public intel. With Mars in your technology sector, you might be tempted to check out other options online, leading to jealousy—or you could even be drawn into snooping on a love interest’s devices, something that is NOT recommended!    Mercury-Jupiter meetup You’ll feel safe speaking from the heart, as the most forthright planets sync up in your eighth house of intimacy and bonding. You’re not likely to get your needs met if you don’t let anyone know what they are!Take your business relationships as seriously as you do your interpersonal ones this month, Ram. With the generous Sun in Libra and your seventh house of dynamic duos until October 23, you’ll benefit from devoting quality time to networking and just schmoozing. Not every conversation needs to have an agenda. Get to know your clients and coworkers as people, not just job descriptions. The more authentic your connections, the more people will be willing to lend you a hand or word of wisdom. And with passionate Mars sailing through Aquarius and your collaborative eleventh house through mid-November, people may be approaching YOU with some team-spirited ideas. Just say yes!A great day to pool your talents and resources is October 8—the year’s only new moon in Libra, which energizes your partnership zone. If you’ve been working toward a deal or contract and it’s been slow going, this could signal a major leap forward. (Or clearly show you that it’s time to walk away and pour your prodigious talent into something more viable.) It’s a chance for new beginnings, perfect for exploring potential synergies with people you feel a click with. This could be someone from your past since the ruler of Libra, magnetic Venus, will be retrograde from October 5 to November 16. Tie up any loose ends during this pivot because when she resumes forward motion, you’ll have dropped some exciting new pins in your GPS and will be eager to speed toward them!A tempting work opportunity could come your way at (or in the two weeks following) the Taurus full moon on October 24. Because it lands in your second house of finances and security, this could signal a big bump in pay or a surprising new income stream. Don’t look a gift horse in the mouth, but make sure you conduct thorough due diligence before you leave that bird in the hand for however many might be in the bush! Mercury-Pluto square Under this hotheaded clash, watch what you say and hold your cards close to your vest. People may seem open, but they could have some less-than-honorable ulterior motives.
Fresh start, anyone? Today's new moon in Libra and your seventh house of relationships helps you turn to a blank page in a storied (and heavily scripted) union. It IS possible to let bygones be bygones...if you can agree to leave a well-worn subject off the table for good. Begin to rebuild by focusing on common ground. New partnership possibilities may emerge as you find yourself dazzled by an attractive opposite. Whether for business, pleasure or a combo platter of the two, keep your mind wide open to new types.Craving a closer connection, Ram? Today, Mercury, the planet of communication, slips into your intimate eighth house until October 31. For the next three weeks, bonding with your nearest and dearest becomes top priority. You may decide to take a blossoming relationship to the next level (could it be time to say "I love you"?), or you and your partner might have a much-needed heart-to-heart. And be honest: Could you let go of some lukewarm associations to make more space for the ones that matter most?Are they worth your time...or wasting it? You may feel conflicted about people today, as a complicated Venus-Mars square casts you as the unwitting co-star of a "will-they-won't-they" rom-com. Don't make excuses for bad behavior or shortcomings. If people aren't ready to go "all in," keep them in the casual zone. On the other hand, you might be the one playing games with someone's heart. If so, check yourself and come clean. Dragging people through your uncertainty will only create bad blood. Coupled? This tense transit could leave you feeling annoyed with your S.O. Rather than making a mountain out of a molehill, take some space and time for yourself.Today, the moon is conjunct expansive Jupiter in Scorpio, helping you approach any knotty emotional or financial issues from a fresh POV. Perhaps a world-changing idea awaits your masterful touch. You have the rare ability to be both single-minded AND open-minded, so apply your powers of concentration to a visionary undertaking. Developing a financial model for a sustainable living nonprofit? Skillfully negotiating the final terms of a deal? Go for it, Aries. The eighth house rules joint ventures, so don't be surprised if an appropriate plus-one “magically” appears. Romantically, you could enjoy feeling like half of a "power couple"—or you could meet someone with serious dynamic-duo potential.Today, the Sun in Libra, your house of relationships, squares off with shadowy Pluto. If you're about to take a romantic partnership to the next level, you may realize there are matters that need to be addressed first. This could be anything from settling a tired old argument to something more serious, like resolving issues from your childhood that still color your interactions. It's worth investing the time and energy into healing, Aries. You'll feel lighter once you've shed that baggage.A long-distance connection percolates with possibilities on Saturday. Did you meet someone during your summer travels with whom you'd like to reconnect? Shooting off a quick text could lead to a surprising synergy. Or get plans underway to visit a friend (or love interest) who has relocated to a new metropolis. Closer to home, sparks could fly with a cutie from a different culture. Keep an open mind, Aries. Have you lost a bit of your edge during the quick transition from lazy summer to focused fall? You've got goals, but many of them are short-term—AND your steam may have fizzled once you really got started. You can get your fighting-spirit mojo back on Sunday as the moon shifts into Capricorn and your tenth house of career ambition and success. That heat you feel might be a fire getting lit in your belly. Think about what's most important to you, then take a big step in that direction!' 
    'Love is in the air! Today's new moon in Libra and your fifth house of amour accelerates your heartbeat. Solo Geminis may feel motivated to do some right-swiping. Prefer to mingle in real time? Find some Monday-night cultural activities, dress up and see who's there. If nothing else, this will be a warm-up for more flirty socializing. If you're in a relationship, do something to revive the playfulness and passion tonight. Don't shy away from the "what's next for us?" conversation. Even if house-hunting, getting engaged or making babies is NOT in your immediate future, it can be exciting to muse about it with bae. Clutter, clutter, everywhere! The time has come to streamline and systematize, Gemini—before you waste another second digging for "missing" papers and keys. With your ruling planet, clever Mercury, in your wellness and admin sector until October 31, you'll have plenty of momentum for this efficiency mission. Organize your calendar while you’re at it. Wouldn't it be nice to settle into a groove for a change? The idea of a structured routine might sound boring, but there's a lot to be said for the stability it provides. Schedule important things like exercise, grocery-shopping, house-cleaning and rest, so you can enjoy your social activities even more.Commit or quit? Today, you could experience a wave of uncertainty about a partnership as romanticizing Venus gets a harsh reality check from her dance partner, Mars. You may feel passionately engaged one moment only to be overcome with fears and "what if's" about the future the next. Avoid making any snap decisions while in this fluctuating emotional state. Although there are some details that need to be worked out, know that you're prone to overreacting during this transit. Let the storm blow over. By early next week, you'll have a much clearer perspective. Ready to break a sweat? The moon and expansive Jupiter do a buddy workout in your wellness zone, inspiring you to try a new routine. If you normally head straight to the elliptical, drop into a group class instead—better yet, tap into Jupiter's love of wide-open spaces and go for a bike ride or hike through the crisp autumn air. Experiment with new culinary creations (you could make it a group cooking sesh, since you'll be in a "more the merrier" mood), or swap your banana-based smoothie for a lean, green, antioxidant-rich juice. With the harvest of seasonal produce making its way into the farmer's markets, you'll easily find ways to "eat the rainbow," with zero feelings of deprivation.The Sun in your playful fifth house puts you in the mood for fun. But its tangled angle with possessive Pluto could demand that you spend one-on-one time with a close friend or romantic partner. Maybe you two need to clear up an unresolved issue, or your companion needs to confide in you. Don't get sucked into anyone's spiraling moods, but if you've neglected your closest peeps, give them some quality time. Would inviting them along on your adventures lighten their spirits? The more could be the merrier, even if they resist the idea at first.What was merely a romantic fantasy could turn into something far more tangible on Saturday. Yes, Gemini, like a real relationship—or the early sightings of one. Although the thought of being with Just. One. Person. (glug) can feel like a jail sentence to your free-spirited sign, you won't be bored with a partner whose interests are wide and varied. If there's no one currently on your radar, send out the search parties today. Attending an evening cultural event could lead to a fateful connection. Coupled Gems: Don't give in to the hibernation temptation. Dress up and go see a show! On Sunday, the moon moves into future-oriented Capricorn and your eighth house of wealth and shared resources. Since money doesn't grow on trees, you need to learn more about investing and figure out what's the best course of action for you, whether you've been saving for years or are just getting started. Talk to some savvy friends about what THEY do, and begin your own research by reading a personal finance blog like Investopedia.com.' }  'Dream globally, act locally. Today's new moon in your third house of hometown happenings heats things up in your zip code. You might think you've seen it all, but guess again, Leo. You never know what's percolating on the underground scene. Still not turning up any good leads? Get the action started yourself—if not for the entire population, then at least for YOUR people. Connect to a local venue about co-hosting an ongoing event, like open-mic night or karaoke—or maybe monthly tarot readings. La luna also lights the way to kindred spirits. If you've been in a social slump, get out and explore a new scene or three before the week is through. Oh, the feels! As Mercury dives into Scorpio your sentimental fourth house until October 31, you'll take a plunge into the emotion ocean. Prioritize time with your inner circle during this sensitive cycle. You'll find their company both comforting and uplifting over the next three weeks. Make a nest with some throw pillows and a cozy blanket. You'll crave more quiet time in your lair as Mercury gives you a break from the social whirlwind and crowded venues. Chateau Leo may become the hottest gathering spot in town. Bring on the dinner parties and laid-back crafting and movie nights!Playing caretaker again, Leo? Unless you're dealing with actual children, don't get swept into that role. Today, as Venus retrograde locks into a tense square with Mars in your relationship house, you might have to inform some people that you are no longer available as their on-call support. In your generous zeal, you may have trained them to treat you like their personal secretary, hired hand or chauffeur. Don't unload a laundry list of resentments or pull out the scorecard; but do make it clear that you're only available during specific times (and for certain activities). And if you could use THEIR support with something, don't drop hints—ask them directly!Cozy doesn't have to be confining. Today, the moon and expansive Jupiter meet in Scorpio, your domestic fourth house, inspiring you to throw open the doors of Chateau Leo. Host an impromptu dinner party or just let friends know they're welcome to drop by for a casual visit while you're crafting and watching movies tonight. Jupiter rules travel, so you might feel the call to hit the road and go visit loved ones (a great plan for the weekend) or invite an old pal to come stay with you for a few fun nights. The coast is clear for heartfelt chats and honest revelations. Maybe it's time to make up with your sister or estranged friend, Leo.Watch your words, Leo. Today, the energizing Sun is in Libra and your third house of communication, where it's squaring off with nefarious Pluto. You'll be tempted to pass along some juicy gossip, especially if you overhear something too scandalous or interesting to keep to yourself. But talking about people behind their backs leads to bad karma at best and a tarnished reputation at worst. Instead of spilling your guts, ask yourself why you feel the need to spill someone's secrets. There are other ways to bond that don't bring people down.Just friends...or is something else bubbling below the surface? Saturday's Sun-moon mashup blurs those boundaries a bit. An unspoken attraction could finally be addressed, if for no other reason than to clear the air. Then again, this could lead to a scintillating evening and maybe ongoing benefits. Already attached? Revive the early days with an evening on the town. Opt for an active or thought-provoking date that lends itself to fascinating postgame discussions over dinner and a bottle of vino. On Sunday, as luna marches into Capricorn and your sixth house of well-being, you may be inspired to clean up your diet or get a little more hardcore with your fitness regimen. "Healthy" doesn't have to be boring or full of deprivation, Leo! If you've been living on calzones and haven't seen your yoga mat in months, don't beat yourself up. This is a perfect starting point! The hardest step is always the first. Keep the emphasis on having fun: That's what'll keep you motivated!' }  'Today's new moon in Libra kickstarts an economic-stimulus plan. Is it time to circulate your resume or pitch new clients? Polish up your presentation materials and online profiles: A close friend may have a hot lead! Securely ensconced in a 9-5? Your job description could change in the days ahead. Make sure your skills are up to snuff and be willing to learn something new as the company grows. Freelancing Virgos should network purposefully. You could make a killer contact at an industry soiree. Do you need to be more sensible about the money you already have in the bank? Retool your Q4 budget, eliminating unnecessary recurring charges. Then make sure you're transferring enough funds into your savings account for both a safety net AND something indulgent, like an early 2019 vacay.Ready, set, collaborate! Garrulous Mercury (your ruler) sails into your third house of communication and cooperation until October 31, turning you into networking machine. Whether you're guiding your squad through a cultural-activities tour or working your superconnector magic, you'll have endless charisma. If you're struggling to bring a goal to fruition, embrace the power of partnership. Turning a solo project into a joint venture could bring major gains. While you're at it, get your transportation game up to snuff. Update your ride (or organize a ride share) and invest in a digital device to make your commutes more enjoyable.Loosen up that iron grip, Virgo—even if things aren't going the way you planned. Your desire for control will only slow you down today, as empathetic Venus gets into a strained formation with aggressive Mars. Obviously you don't want to turn into a micromanaging tyrant, but you won’t settle for things that aren’t up to snuff. Before you bark orders, listen to other people's ideas. Someone may actually have a more effective way of doing things—and it could make YOUR life easier. If your plan is still the best one, then stick to it. But partners and teammates will be more agreeable if they feel like their thoughts have been heard.Can't. Stop. Talking! Today, the moon and outspoken Jupiter double down in Scorpio activating your third house of communication and cerebral pursuits. Your mind is on fire with brilliant ideas, and you're on a mission to share them with as many people as you can. Fueling this desire for a global platform is expansive Jupiter, so whether it's a blog, a YouTube channel or a workshop of your own, you KNOW that your witty gems are too good to keep to yourself. You may also be equally hungry to soak up new ideas, so download a new book or see what evening lectures and classes are coming up. Tonight, your inner culture vulture is up for anything, so explore the treasures in your own neighborhood. Kindred spirits await!Your regimented sign functions best when you stick to a plan, a routine and a budget. But with the Sun in your practical second house forming a tricky square to compulsive Pluto, you might rebel against your own overly managed life. A friend could ask for a last-minute favor that eats up your time, or you may be tempted to shop away a stressful day of work. No instant gratification is worth derailing your progress, Virgo, but this mini-crisis could be a call for balance. Make room for moderation so you can enjoy working AND playing hard.How's that nest egg of yours, Virgo? As a security-minded earth sign, you sleep easier at night when there's a little something tucked away. No matter where you are on the savings-plan continuum, set aside some cash, yes, even if it's just a few symbolic dollars. Open up a special account for this purpose and have funds auto-transferred weekly. Already an investment pro? A promising opportunity involving women could emerge on Saturday. Explore! On Sunday, when a strategic Capricorn moon struts into your glamorous, creative fifth house, stop fretting about deadlines and bottom lines and listen to your muse. Check in with inner artiste and take stock of that unfinished painting, screenplay or hip-hop opera. Or, hmmm, maybe the real project is YOU, Virgo! What better or more deserving object for your inspired touch than yourself? Redo your decor, or update your closet for the season. You know when you look good, you feel good—AND are more productive.' }  'Happy cosmic New Year! Today's new moon in Libra hits the refresh button on your internal browser, clearing away that heavily cached personal history…or at least helping you focus on the brighter days ahead. You only get one new moon in your sign per year, so take advantage of its manifestation mojo! Write out a wish list for the next six months. How would you like to grow? What areas of life could use some magic? If you want to accelerate this process, don't just sit there; take decisive action around your dreams. You have the celestial green light to invest in your own self-development, be it a life-changing class, sessions with a supercoach or a spiritual pilgrimage that nourishes your soul.Strengthen your financial foundation, Libra. With messenger Mercury settling into your second house of security for the next three weeks, it's an ideal time to get your cash flow in order. Saving up for a rainy day doesn't hold much appeal for a sign that doesn't even BELIEVE in rainy days. Approach the number-crunching from a more positive perspective. What sunny moments do you want to map out for the future? Enlist the help of a savvy friend in the industry or sit down with an adviser. Even if you've got a solid budget in place, think outside the box for ways to make bank.Today, a perplexing square between your ruler, love planet Venus (retrograde), and scintillating Mars could leave you befuddled about your love life. On the one hand, you'd like nothing more than to snuggle up to someone reliable; but you're also craving variety and fresh experiences. If you're attached, don't give in to the temptation to stray. A wandering eye could lead to serious drama, and you'll regret it a few days from now when this energy passes. Of course, if you're single, follow your gut—and something a little further south! You'll be fine, so long as you don't confuse a one-night stand for The One.Feeling lucky? You might as well splurge on a lottery ticket since the moon is aligned with lucky-charm Jupiter in your second house of moolah. A small gamble could bring a windfall—or you could snag a new client who’s willing to pay you what you’re worth (that alone is like winning the lottery!). In general, be a little more open and willing to go for something if it feels right. That person you’re making small talk with at the industry mixer might wind up being your next big account.Watch out for a "my way or the highway" attitude today, Libra. The Sun in your sign is squaring off with controlling Pluto, causing you to act stubborn and rebellious with your close friends and family members. Before you engage in a battle, make sure the fight is actually worth it. Do you need to clear up unresolved resentment or anger? As much as you dislike confrontation, you need to deal with it diplomatically and directly—and be willing to own your part in any conflicts.Bend, but don't break, Libra. On Saturday, a compromise can be reached that doesn't require you to make too many sacrifices. How much are you willing to give, and where is your bottom line? Be clear about this before you enter discussions. You have the gift of gab today, and you won't get much (if any) resistance when you turn on the charm. Don't veer to the other extreme and take advantage of anyone's kindness, though. Aim to be fair and equitable: It's the Libra way. If you're not in social spirits on Sunday, don't push yourself to make it to brunch. The moon downshifts into quiet Capricorn and your sensitive fourth house. Emotions could run high, causing you to feel a bit touchy and vulnerable. Spend the day at home; time in your happy place will take the edge off things. If you do have to deal with others, allow yourself a time frame that can be flexible and get you back to base at a decent hour. Sunday night is perfect for staying in or hanging with just one person, someone you don't feel the need to be "on" around.' }  'The softer side of Scorpio is peeking through! Today's new moon in your soulful, compassionate twelfth house tugs at the old heartstrings. Drop your guard and let the feelings flow. The intuitive hits you get could make you feel like a walking psychic hotline. Trust that inner knowing and where it’s leading you. Alas, you may realize that it's time to leave a situation that is no longer serving you. Gently back away—you CAN do this gracefully so that no one is traumatized. With this new moon piquing your imagination, a stimulating artistic endeavor could be the perfect thing to engage in this fall/winter. Feeling blocked? Dive into Julia Cameron's "The Artist's Way," a 12-week course for recovering your inner creative.While you might prefer to fly under the radar much of the time, when expressive Mercury moves into your sign until October 31, you may be called into the public eye. Forget being modest or settling for a humblebrag; it's time to self-promote! Worried that people will judge you as being arrogant? Focus on how your skills will benefit others. If you've felt out of sync with a friend circle, don't force the togetherness out of misplaced loyalty. Seek people who share your current interests and make room for those who will help you soar. This is also a perfect time to dive into a solo project and enjoy the pleasure of your own independent company.No pouting, please, Scorpio—and stop yourself from storming out of the room. Today, a tense battle between Mars in your sensitive fourth house and retrograde Venus in Scorpio could throw your emotional equilibrium out of whack. You want attention...and you want it from one person in particular. But they might not be able to give you that—at least not on your timeline. Don't declare them "dead to me" simply because they failed to return your text within an hour. See the "space" as a plum opportunity to expand your social horizons…with someone else. Truth is, you'll be a happier Scorpio when your love tanks are filled at more than just one station. Been waiting for a sign to make a gutsy move? How’s this: The moon aligns with lucky Jupiter in your sign today, helping you shatter barriers in any arena. You've never been one to pay deference to group-think, but how often do you actually share your own strong opinions and brilliant ideas, Scorpio? No more holding back! Need a pep talk? Ask a couple close people what they think your best traits are and where you could stand a little improvement. Stay open to their feedback; a few tweaks could make a huge difference.You don't take kindly to others invading your territory or taking credit for your ideas, Scorpio. Today, with the Sun in your house of hidden agendas forming a tough angle to your co-ruler Pluto, you'll be ready to defend yourself against any perceived threats. A conflict with a colleague, friend or sibling could arise, and the only way to handle it is to get to the bottom of it. You might realize your perception is wrong, but if it isn't, dive in and address the issue.You're a master at spotting untapped potential, Scorpio, and this Saturday, it could be staring you in the face. Are you willing to take an ingenue under your wing? Weigh the costs and potential benefits. Beyond simply paying it forward and helping to advance a sweet soul toward their life purpose, what's in it for you? You could groom a trusty sidekick or creative collaborator, which would make your life richer indeed. On Sunday, as the moon dips into Capricorn and your super-connected communication center, you might feel like you don't have enough privacy in your life. While you enjoy socializing, you like to do it on your terms, sometimes preferring the company of just one friend, a pet or Netflix—which is fine. Just make sure you're not compensating with an overreliance on your social media friends. Interacting virtually doesn't cut it after a certain point. Get out and take a risk by meeting new people. Under these moonbeams, you could be pleasantly surprised by who shows up.' }  'You've never met a stranger, Sagittarius—but who are your true people? Today's new moon lands in your eleventh house of community, helping you radar in on a squad of kindred spirits. Already found them? This is your nudge to become the nucleus of a supergroup, bringing together these wunderkinds from the various areas of your life. Once you do, expect a buzzy fall/winter season as you meet for weekly potlucks and even plan a group vacation. Look for online forums and Facebook groups that revolve around your more “fringier” interests. Your inner geek will also be piqued. Got an idea for an e-venture, blog, mobile app or other online mission? Call up the developers or learn the necessary coding. This could turn into something enjoyable—and profitable—over the coming six months.Energy vampires, begone! Social Mercury cruises through your healing sector until October 31, helping you snip toxic ties. In addition to warding off the draining soul-suckers, pay attention to your inner dialogue. Start replacing any self-critical thoughts with tons of self-love and affirmations. If you keep hitting the same frustrating wall in a relationship, take a breather for the next few weeks—or if you know this impasse can't be healed, break it off for good. But don't give up before consulting the pros. Therapists, mentors, coaches and spiritual leaders can support you with clearing away the psychic clutter and replacing it with authentic self-confidence.Sending out mixed signals, Sagittarius? Uh-oh. Under today's volatile mashup of sensitive Venus retrograde and aggressive Mars in your communication zone, don't be coy or vague or even remotely mysterious—well, not unless you want your words to be seriously misinterpreted. If you're not ready to touch a certain subject, avoid people who seem to be angling for a fight. The tension should blow over soon, but engaging today could escalate a minor grievance into an all-out war.Take time during the day to reflect on how you’re really feeling. When people ask, you may auto-respond with "great!” But how true is that? Today, as the emo moon buddies up with your ruler, philosophical Jupiter, in your introspective zone, you’ll have a clear channel to what’s going on deep inside your soul. You don’t have to wear your heart on your sleeve or burst into tears, but if you’re feeling overworked or down, it’s okay to let people know. They might actually find it easier to connect with you when you drop your guard.With the life-giving Sun in Libra and your free-spirited eleventh house, you'll be full of big ideas today; but a tense square to shadowy Pluto in your stable second house delivers a reality check. It's not that you shouldn't have grand dreams, Sagittarius—those travels, business ideas and visionary projects are all achievable. It's just that nothing will happen without a proper plan. Instead of just diving in, take the time to think it through from every possible angle. And don't forget to map out a budget!You could use a little breathing room from anyone or anything that's too demanding on Saturday. Fortunately, a flowing moon-Sun formation paves the way for playful diversions. Spend the day reading, shopping or working on crafts. Make evening plans with an inspiring, eclectic and fun-loving crew. From karaoke to a live show to dancing at a dive bar, the time has come for you to let down your hair. On Sunday, when the moon marches into grounded Capricorn and your second house of money and security, it's the perfect time to check your bank and credit card statements and pay some bills in a timely manner. Sometimes even your visionary sign needs to climb down from your mountaintop and deal with the mundane, pragmatic things that keep the wheels of everyday life greased. If your expenses are outpacing your income, you might want to get a little more serious about creating—and sticking to—an actual budget.' }  'Ready to rise up a few professional rungs—or maybe take control of the whole ladder-making industry? Today's new moon in Libra activates your ambition, helping you think even bigger! Pause from the grind to map out some six-month career goals. Your mind may be on ownership, which is where the real money comes in. (Hello, CEO.) If you're still a rookie in your field, train your sights on growth opportunities. Volunteering alongside an industry VIP might be the fastest way to get a combat boot in the door, Capricorn. And there's no doubt you'll dazzle when you do, which could set you up for accelerated progress.There's strength in numbers, Capricorn! Today, communicator Mercury moves into your eleventh house of teamwork and technology until October 31. Connect to kindred spirits through group activities and social media—and organize your own online community if you feel inspired to bring people together. This three-week cycle is all about collaboration, so keep your radar attuned for team-based projects that could utilize your expertise and organizing powers. Join forces with like-minded folks—some seriously innovative ideas could come out of your brain trust.Moody much, Cap? Today, your stability-seeking side could be at war with your independent streak as Venus retrograde and Mars lock into a tangled angle. One minute you're pushing people away so you can get some much-needed "me time"; the next, you're pouting because no one invited you to hang out. You can't have it both ways, Capricorn, so stop yourself from sending any messages when you're feeling unclear. And as a rule, don't make any radical decisions while you're in this conflicted emotional state. Just because you're feeling tempestuous today doesn't mean you won't need solid supporters at your side tomorrow.Your leadership skills are a point of pride for your visionary sign, but admit it, Sea Goat: Sometimes it can get a little lonely up on your perch. Today's socially stimulating sync-up of the moon and effusive Jupiter in your communal eleventh house can act like an icebreaker with a new clique or group. Just show up with your can-do energy, and people will flock to you. Resist passing judgment till you get to know what they’re all about. This could be the very squad you’ve been looking for!If you want to compliment a Capricorn, make a positive remark about a professional achievement—and if you want to enrage a Capricorn, offer unsolicited advice in that department. Today, the Sun is in Libra, your tenth house of ambition, where it's forming a tangled angle to controlling Pluto. If anyone tries to patronize you with condescending career suggestions or attempts to micromanage you, you'll take umbrage. Look past your ego and listen to what's being said—you might miss out on some legitimate advice if you don't keep an open mind.An imaginative, can-do angle between the Sun and moon helps you pull off a brilliant plan this Saturday, one that could put your name on the map. Think big...now bigger still. The sky isn't even the limit for you. You're capable of more than you've given yourself credit for. Err on the side of being "too much," and you'll hit that ambitious mark. On Sunday, the moon grooves into your sign for the next two and a half days. All work and duty all the time? No way, Capricorn! This is all the permission you need to bow out of any "requisite" mind-numbing events and spend your time engaged in activities that make you happy and keep you stimulated. As for anyone who tries to guilt-trip you into going anyway, let them know you appreciate their desire to spend time with you and that you're happy to see them—but today, you're flying solo!'
	'Partnerships for the win…or the draw? October’s major focus is on your closest interpersonal ties. Does everything feel smooth and equitable between you? And even if it does, where might you grow and improve as a duo? The Sun spends all month in your companionship houses (yay for that), pulling supportive people your way and reminding you that no matter how fiercely independent you are, you can always go further when you cooperate.But…that kumbaya concept gets complicated this year. On October 5, Venus, the guardian of love and harmony, will back into a six-week retrograde that could disrupt the balance of your bonds. It feels par for the 2018 course, where a lot of the hopeful transits have also included a disclaimer (“but you’ll also need to watch out for…”).Let’s start with the positive stuff: Setting the template for togetherness, the Sun is making its annual journey through Libra and your seventh house of companionship, commitment and mutuality until October 23. After that, it will plunge into Scorpio and your eighth house of merging, which could take your connection to a deep and permanent place.The October 8 Libra new moon opens a six-month window to explore a stronger union. Hello, dynamic duos! The seventh house is the realm of committed relationships, and during the first three weeks of October, a budding business or romantic partnership could move into “official” terrain. If you’re already part of a solid alliance, it’s a great time to get yourselves back in sync and to plan more meaningful one-on-one time together.How’s the balance of give-and-take in your life? Take inventory. If you notice that you’re surrounded by a lot of supportive people, use this new moon to express gratitude (and return the gesture!). On the flip side, you might be shocked to admit how FEW people seem to have your back, which begs the question: Have you fallen into playing the Aries hero or savior role? If so, start shifting to a more mutual dynamic (step one: ASK for what you need!) and disentangling yourself from draining ties.Libra is your opposite sign, so you’ll be out of your individualistic Aries element this month, and that can feel a bit disorienting. With the enlivening Sun so far away on the zodiac wheel, your life force energy can be low at moments, leading to burnout if you try to do everything yourself. Ding-ding-ding! The solution is written in the stars for you. Libra season urges you to cooperate, collaborate and delegate, and to seek out complementary “equals” who can assist you on your mission. Just watch out for a possible power struggle on October 12, when the Sun and Pluto go mano-a-mano in the second of their two annual squares, which could dredge up anything from daddy issues to manipulative agendas.This brings us to the aforementioned Venus retrograde, the love planet’s challenging six-week backspin that happens every 18 months. This go-round, you’re in the hot seat as Venus reverses through Scorpio and your intimate eighth house from October 5 to 31 before backflipping into Libra and your partnership sector until November 16. You’ll become acutely aware of any flaws in the foundation of your closest ties or of ways you might shift your own attitude and approach to partnership. Relationships can be tested during Venus retrograde (stay tuned for the “shocking celebrity splits!” headlines), and this can be an important time to do repair work, perhaps through therapy or a trial separation. If you’ve drifted out of alignment with someone, Venus retrograde can actually be a helpful time to get back on the same page. Working with a counselor or coach could reveal the root of key sticking points. Single Aries could get an eye-opening view of the blocks you have around commitment, and work toward dismantling them.Retrogrades are designed to put us in touch with the past—sort of like a review period or an audit. Where have you swept something under the rug, left unfinished business or skipped over an essential part of the puzzle? An ex could resurface, or you might decide to give a one time love another chance. Proceed with caution during the retrograde—it might be that your timing is finally right, but it could also mean that you simply didn’t learn an important lesson the first time around.You’ll have a chance to delve deeply into ALL of that starting October 23, when the Sun begins a monthlong voyage through Scorpio and your intimate, inquisitive eighth house. Put on your  “love detective” hat and go into the weeds during this sharp-minded solar cycle. With the Sun in this private sector of your chart, you’ll crave more time alone (possibly with the company of a scintillating plus-one), and your moods can be a force of nature. Tune out distractions if you’re working on a big project because you can make incredible headway with quiet, focused time.The next day, October 24, brings the year’s only Taurus full moon in your second house of work, money and security—some stabilizing moonbeams that you’ll be oh-so thankful for. A work project or goal you’ve been hustling toward since the May 15 Taurus new moon could come together with a profitable flourish. It’s also a great day to step back and take stock of everything from your budget to your daily routines. Before the holidays kick in, is there anything you could put in place to help you stay grounded and healthy? It takes three weeks to form a habit, and you’ve got about that much time until the Christmas carols start piping through every store’s sound system and everyone starts passing around the sugary treats and seasonal cocktails.Before you root in to any new regimens, do a little creative brainstorming. This new moon is traveling in a close conjunction with changemaker Uranus, urging you to think outside the box. How can you use technology or take an innovative approach to your finances, work or another area of life you’re trying to improve?Also on October 24, the Sun and Uranus will form their once-a-year opposition, a tense aspect that can bring out volatile tempers, egos and buried anger. Trying to change everything at once could push you to the brink of burnout. Pace yourself, Aries—hard as that is for you to do. But if you feel like a person in an authority role (e.g., a boss, a doctor, a teacher) is moving too slowly, abusing their power or not serving your needs, DO speak up. Sometimes, reaching a breaking point is a good thing. Just be mindful of your delivery!Channel some of that pent-up energy into your Halloween plans. This year’s frightfest will feature a Leo moon in your flamboyant fifth house, sounding the call for costumes and cavorting—perhaps with a side of frisky fun, since your romance sector is on fire. But watch for a jealous beam from the Scorpio Sun (which will be in conflict with la luna) and from retrograde Venus, which will form a polarizing opposition to combustible Uranus before backing out of Scorpio and into Libra. You or a fellow reveler might get a little competitive or possessive if one of you starts attracting attention. Ugh! By all means, do NOT tone down your authentic self, but if you’re bringing bae to the soiree, make sure everyone is feeling grounded and secure before you head out into the wild night.This month’s love landscape will require some stealthy navigating. Venus, the planet of romance and interpersonal harmony, is retrograde from October 5 to November 16. This transit, which happens every 18 months and lasts six weeks, can test even the most rock-solid relationships. For you, this particular Venus retrograde will split its time between Scorpio and Libra, touching down in your most committed sectors. While this could mean trouble in paradise, Venus retrograde also grants you a chance to correct any imbalances and do the healing repair work.Until October 31, Venus will backtrack through Scorpio and your eighth house of merging, intimacy and sex, giving you second thoughts about how far you want to go in—or maybe a second chance to connect with someone if it didn’t work out the first time! Venus’ backslide through this hyper-vigilant house can brew up stormy feelings of jealousy, possessiveness and distrust. But is it them…or is it you? If you’re still holding onto some old resentments, this Venus retrograde can help you dismantle the self-protective armor that’s keeping love away.Meanwhile, your randy ruler, Mars, is in Aquarius and your eleventh house of groups and emotional detachment all month. This could potentially help diffuse the intensity of Venus retrograde, giving you the ability to step back from heated situations or jumbled emotions. Friends could become lovers—or at least ardent admirers—with magnetic Mars in this social part of your chart. That’s all good, except that this attention-scattering energy will be in direct competition with Venus’ relentless campaign to promote bonding and deep connections.That tension reaches a peak on October 10, when Venus and Mars lock into yet another of this year’s heated squares, a month after their prior one. With both of the love planets in stubborn fixed signs, you could not only feel pulled between divergent interests, it will be hard to get anyone to compromise. Venus wants depth, Mars wants breadth! This square could cause you (or someone else) to run hot and cold, going all the way in one minute then cutting off the flow of feelings the next. You might leap into a no-strings fling or flirtation only to find yourself getting shockingly attached. Or your scintillating passion could suddenly cool (warning: boudoir temperatures could make a sudden drop!).For you, this Venus-Mars square sounds the call to balance head and heart and cool logic with all-consuming emotions. You don’t want to step entirely back from your passions and raw feelings, but a little objectivity will go far. Careful about venting to friends or hinting at drama on social media, as your private confessions could become public intel. With Mars in your technology sector, you might be tempted to check out other options online, leading to jealousy—or you could even be drawn into snooping on a love interest’s devices, something that is NOT recommended!  Key Dates: October 29: Mercury-Jupiter meetup You’ll feel safe speaking from the heart, as the most forthright planets sync up in your eighth house of intimacy and bonding. You’re not likely to get your needs met if you don’t let anyone know what they are!Take your business relationships as seriously as you do your interpersonal ones this month, Ram. With the generous Sun in Libra and your seventh house of dynamic duos until October 23, you’ll benefit from devoting quality time to networking and just schmoozing. Not every conversation needs to have an agenda. Get to know your clients and coworkers as people, not just job descriptions. The more authentic your connections, the more people will be willing to lend you a hand or word of wisdom. And with passionate Mars sailing through Aquarius and your collaborative eleventh house through mid-November, people may be approaching YOU with some team-spirited ideas. Just say yes!A great day to pool your talents and resources is October 8—the year’s only new moon in Libra, which energizes your partnership zone. If you’ve been working toward a deal or contract and it’s been slow going, this could signal a major leap forward. (Or clearly show you that it’s time to walk away and pour your prodigious talent into something more viable.) It’s a chance for new beginnings, perfect for exploring potential synergies with people you feel a click with. This could be someone from your past since the ruler of Libra, magnetic Venus, will be retrograde from October 5 to November 16. Tie up any loose ends during this pivot because when she resumes forward motion, you’ll have dropped some exciting new pins in your GPS and will be eager to speed toward them!A tempting work opportunity could come your way at (or in the two weeks following) the Taurus full moon on October 24. Because it lands in your second house of finances and security, this could signal a big bump in pay or a surprising new income stream. Don’t look a gift horse in the mouth, but make sure you conduct thorough due diligence before you leave that bird in the hand for however many might be in the bush!Key Dates: October 3: Mercury-Pluto square Under this hotheaded clash, watch what you say and hold your cards close to your vest. People may seem open, but they could have some less-than-honorable ulterior motives